{"/en/about/":{"data":{"":"","qiandus-payment-method#QianDu\u0026rsquo;s payment method":"What is QianDu Qiandu is a community that 100% protects user privacy. Users and developers can trade or recommend any digital goods, technical services, APIs and other businesses without industry restrictions on the platform.\nThe community promises that any developer who can enter the community must be an industry practitioner who has paid a deposit or has rich experience.\nThe story of QianDu Qiandu was formerly a well-known Chinese forum. After the founder X passed away for some special reasons, his followers Jack Tang, Mark Chen and Andy Musk invested and founded QianDu.\nQianDu is a development community on the Internet that pays great attention to privacy, and is operated with the support and expertise of many partners around the world.\nFor many years, we have been committed to providing reliable and trustworthy solutions in the most private way, and have made it our responsibility to truly play a role for users.\nAs a self-reliant remote team, we are not bound by any policies or investor requirements. This freedom allows us to respond flexibly to changes and focus on what really matters: our users.\nThe founding team started working in the privacy service industry in 2008 without venture capital or external funding. Every service project we develop and every decision we make is carefully considered and user-centric. The journey over the years has not always been smooth, but it has been fruitful.\nWe make decisions based on what is best for your needs, not what is best for the board of directors.\nAndy Musk：I hope that our users can have real freedom, and what we need to do is to help them (A’s words at the all-staff meeting truly represent the thoughts of all of us)\nThe way to user QianDu Being physical doesn’t mean being limited.\nIn fact, it’s our superpower. Our small size — secure and 1v1/0v1-enabled — allows us to move faster, be more responsive, and have partners from all over the world working remotely to provide you with everything you need.\nWhen you use QianDu, you’re not just using a platform; you’re engaging with our passion and vision to build a powerful, reliable, and extremely secure service platform.\nThe promise of QianDu We are deeply connected to our users.\nEvery email, question, or feedback you send is read and responded to by real people — not robots, not outsourced support teams, but individuals at the heart of QianDU.\nWe are committed to providing a service that solves your problems and provides a seamless, trustworthy experience.\nThe values of QianDu Reliability: With years of experience in the industry, we understand the critical nature of our work. Our remote team members are mostly top talent from Silicon Valley, New Delhi, India, and Zhongguancun, Beijing. Transparency: We believe in open communication. QianDu enables us to be honest about our capabilities and limitations, and we always strive to exceed your expectations. Accountability: Being primarily managed by QianDu means we are responsible for all aspects of our team members’ service. We stand behind our work and are accountable for our successes and mistakes. Innovation: We are always looking for ways to improve and innovate. Our agile structure allows us to quickly implement new ideas and respond to user needs. Personal touch: We believe in the power of relationships. When you work with QianDu, you are more than just a customer - you interact directly with the people behind the product. Thank you for choosing QianDu and supporting the independent development community.\nWe have been growing and developing for sixteen years, and we look forward to continuing this journey with you, constantly improving our services, and becoming your trusted partner in the Internet space.\nQianDu’s payment method QianDu only supports the use of BTC, USDT to pay for the services provided by QianDu, and we will change the payment address after a period of time. Please refer to the wallet address published here:\nBTC: bc1plklsdytnfk2elhd00gg5r08e3cdye6j96cr4etpnd0crgpnuzr6s69hgqj\nUSDT(ERC20): 0xE40E0dc445BA8D6C7db0318cC48D34556457FE13\nUSDT(TRC20): TUXiSG7EVk1rrc9pQzCLe6W1P3btvnB7Dm","the-promise-of-qiandu#The promise of QianDu":"","the-story-of-qiandu#The story of QianDu":"","the-values-of-qiandu#The values of QianDu":"","the-way-to-user-qiandu#The way to user QianDu":"","what-is-qiandu#What is QianDu":""},"title":"About QianDu"},"/en/about/contact/":{"data":{"":"Hi~ I’m glad to meet you in Qiandu and look forward to your joining Qiandu soon!\nContact Us ","can-i-join-qiandu#Can I join QianDu?":"Of course, we welcome privacy-conscious developers/bloggers from all over the world to join us. After joining the QianDu family, you will definitely gain more in terms of connections and income.","what-can-i-do-by-joining-qiandu#What can I do by joining QianDu?":"You can provide services to QianDu visitors:\nNetwork and Applications Network Security Consultant Payment Service Guaranteed Transaction Business Marketing Consultant Web3 Blockchain Service Software Trading You can also participate in QianDu’s content maintenance\nBlog Cross-border Trade Tool Navigation Blockchain Tool Navigation AI Tool Navigation Tool Navigation "},"title":"Join the community"},"/en/about/docs/":{"data":{"":"Explore the following sections to learn how to participate in the maintenance of the Qiandu community:\nDirectory structure Configuration Markdown Code Highlighting LaTeX Formula Chart shortcodes "},"title":"Community Maintenance Guide"},"/en/about/docs/configuration/":{"data":{"":"Qiandu reads configuration from hugo.yaml in the root directory of the Hugo website. In the configuration file, you can configure all options for the site. You can find the configuration file for this site in exampleSite/hugo.yaml as a start.","footer#Footer":"Copyright Notice To modify the copyright text that appears in the footer of your website, you need to create a file called “i18n/en.yaml”. In this file, fill in the new copyright text, like this:\ni18n/en.yamlcopyright: \"© 2024 Qiandu.org\" You can find a sample i18n/en.yaml file in the GitHub repository. Alternatively, you can use Markdown formatting in the copyright text.","navigation-bar#Navigation Bar":"Menu The menu in the upper right corner is configured in menu.main in the configuration file:\nhugo.yamlmenu: main: - name: Documentation pageRef: /docs weight: 1 - name: Blog pageRef: /blog weight: 2 - name: About pageRef: /about weight: 3 - name: Search weight: 4 params: type: search - name: GitHub weight: 5 url: \"\" params: icon: github There are several different types of menu items:\nLink to a page in the site with pageRef - name: Documentation pageRef: /docs Link to an external URL with url - name: GitHub url: \"https://github.com\" Search bar with type: search - name: Search params: type: search Icon - name: GitHub params: icon: github These menu items can be sorted by setting weight.","others#Others":"Favicon To customize the favicon, place the icon file in the static folder to override the default favicon in the theme:\nstatic android-chrome-192x192.png android-chrome-512x512.png apple-touch-icon.png favicon-16x16.png favicon-32x32.png favicon-dark.svg favicon.ico favicon.svg site.webmanifest Include the favicon.ico and favicon.svg files in your project to ensure that the site’s favicon displays correctly.\nWhile favicon.ico is generally suitable for older browsers, favicon.svg is supported by modern browsers, so a more modern approach is to add favicon-dark.svg to provide a better experience in dark mode.\nFeel free to use a tool like favicon.io or favycon to generate these icons.\nColor Theme Configuration Use the theme setting to configure the default theme mode and a toggle button that allows visitors to switch between light or dark mode.\nhugo.yamlparams: theme: # light | dark | system default: system displayToggle: true Options for theme.default:\nlight - Use light mode only dark - Use dark mode only system - Follow system theme.displayToggle controls the display of a toggle button for changing themes. When set to true, visitors can switch between light or dark mode, overriding the default.\nPage width The page width can be adjusted via the params.page.width parameter in the config file:\nhugo.yamlparams: page: # full (100%), wide (90rem), normal (1280px) width: wide There are three options: full, wide, and normal. The default page width mode is normal.\nSimilarly, the width of the navbar and footer can be adjusted via params.navbar.width and params.footer.width.\nSearch Full-text search powered by FlexSearch is enabled by default. To customize the search index, set params.search.flexsearch.index in the configuration file:\nhugo.yamlparams: # Search search: enable: true type: flexsearch flexsearch: # index page by: content | summary | heading | title index: content Options for flexsearch.index:\ncontent - Search the entire content summary - Summary Hugo Content Summaries heading - First and second level headings title - Search titles only To customize the tokenization, set params.search.flexsearch.tokenize in the configuration file:\nparams: # ... flexsearch: # full | forward | reverse | strict tokenize: forward Options for flexsearch.tokenize:\nstrict - Strict word matching forward - Word prefix matching reverse - Word prefix and suffix matching full - Word substring matching. Under the default word segmentation logic, a Chinese sentence is a “word”\nTo exclude a page from the search index, change excludeSearch: true in the front matter:\ncontent/docs/guide/configuration.md--- title: Configuration excludeSearch: true --- Google Analytics To enable Google Analytics, set services.googleAnalytics.ID:\nhugo.yamlservices: googleAnalytics: ID: G-MEASUREMENT_ID ","right-sidebar#Right Sidebar":"Table of Contents The table of contents is automatically generated based on the title in the content file. You can disable it by setting toc: false in front matter.\ncontent/docs/guide/configuration.md--- title: Configuration toc: false --- Edit this page link To configure the edit this page link, we can set params.editURL.base in the configuration file:\nhugo.yamlparams: editURL: base: \"https://github.com/your-username/your-repo/edit/main\" The edit link will be automatically generated for each page. To set an edit link for a specific page, you can set the editURL in the front matter of the page:\ncontent/docs/guide/configuration.md--- title: Configuration editURL: \"https://example.com/edit/this/page\" --- ","sidebar#Sidebar":"Primary Sidebar The primary sidebar is automatically generated from the content directory structure.\nFor more details, go to Directory Structure.\nAdditional Links Additional links for the sidebar are configured in the menu.sidebar section of the configuration file:\nhugo.yamlmenu: sidebar: - name: More params: type: separator weight: 1 - name: \"About\" pageRef: \"/about\" weight: 2 - name: \"Docs ↗\" url: \"https://gohugo.io/name/\" weight: 3 "},"title":"Configuration"},"/en/about/docs/deploy-site/":{"data":{"":"Qiandu generates static sites locally and has deployed multiple hosting methods for synchronization and supports user access. You can apply for synchronization permissions. After joining our Github, your changes will be synchronized to the world in an instant.","cloudflare#Cloudflare":"Cloudflare main node dev.qiandu.org\nCloudflare backup node: qiandu.pages.dev","github-pages#GitHub Pages":"GitHub main node qiandu.org\nGitHub backup node: qianduorg.github.io","netlify#Netlify":"Open entrance is temporarily closed","vercel#Vercel":"Open entrance is temporarily closed"},"title":"Visit qiandu.org"},"/en/about/docs/diagrams/":{"data":{"":"Currently, Qiandu supports Mermaid charts.","mermaid#Mermaid":"Mermaid is a JavaScript-based chart drawing tool. Its text definition is similar to Markdown and can dynamically create charts in the browser. For example: flow charts, sequence diagrams, pie charts, etc.\nUsing Mermaid in Hextra is as easy as using a code block:\n```mermaid graph TD; A--\u003eB; A--\u003eC; B--\u003eD; C--\u003eD; ``` Will render as:\ngraph TD; A--\u003eB; A--\u003eC; B--\u003eD; C--\u003eD;Sequence diagram:\nsequenceDiagram participant Alice participant Bob Alice-\u003e\u003eJohn: Hello John, how are you? loop Healthcheck John-\u003e\u003eJohn: Fight against hypochondria end Note right of John: Rational thoughts prevail! John--\u003e\u003eAlice: Great! John-\u003e\u003eBob: How about you? Bob--\u003e\u003eJohn: Jolly good!For more information, go to Mermaid Documentation."},"title":"Diagrams"},"/en/about/docs/latex/":{"data":{"":"$\\KaTeX$ is used to render LaTeX math expressions. Enable this by setting math to true in frontmatter.\nMarkdown--- title: \"My Page with LaTeX\" math: true --- When enabled, scripts, stylesheets and fonts from KaTeX will be automatically included in your website. This allows you to use LaTeX math expressions in Markdown content.","chemical-expressions#Chemical expressions":"Chemical expressions are supported by mhchem.\nInline: $\\ce{H2O}$ is water.\nIndependent paragraphs:\npage.md$$\\ce{Hg^2+ -\u003e[I-] HgI2 -\u003e[I-] [Hg^{II}I4]^2-}$$ $$\\ce{Hg^2+ -\u003e[I-] HgI2 -\u003e[I-] [Hg^{II}I4]^2-}$$","example#Example":"Markdown content supports LaTeX math expressions inline and in separate paragraphs.\nInline page.mdThis $\\sigma(z) = \\frac{1}{1 + e^{-z}}$ is inline. This $\\sigma(z) = \\frac{1}{1 + e^{-z}}$ is inline.\nIndependent paragraphs page.md$$F(\\omega) = \\int_{-\\infty}^{\\infty} f(t) e^{-j\\omega t} \\, dt$$ Will be rendered as:\n$$F(\\omega) = \\int_{-\\infty}^{\\infty} f(t) e^{-j\\omega t} , dt$$","supported-features#Supported features":"For a list of supported symbols, go to Formulas supported by KaTeX."},"title":"LaTeX Formula"},"/en/about/docs/markdown/":{"data":{"":"Qiandu supports Markdown for writing content, creating lists, etc. This page will show you some of the most common Markdown syntax examples used by Qiandu.","configuration#Configuration":"Qiandu uses Goldmark to parse Markdown. Markdown rendering can be configured in markup.goldmark in hugo.yaml by contacting the community administrator. The following is the default configuration of Qiandu:\nhugo.yamlmarkup: goldmark: renderer: unsafe: true highlight: noClasses: false For more options, go to Configure Markup.","markdown-basics#Markdown Basics":"Text Styles Style Syntax Example Output Bold **bold text** **bold text** bold text Italic *italicized text* `italicized text italicized text Strikethrough ~~strikethrough text~~ ~~strikethrough text~~ strikethrough text Subscript \u003csub\u003e\u003c/sub\u003e This is a \u003csub\u003esubscript\u003c/sub\u003e text This is a subscript text Superscript \u003csup\u003e\u003c/sup\u003e This is a \u003csup\u003esuperscript\u003c/sup\u003e text This is a superscript text Quote Block quote with superscript:\nDon’t communicate by sharing memory, share memory by communicating.\n— Rob Pike1\nMarkdown\u003e Don't communicate by sharing memory, share memory by communicating.\u003cbr\u003e \u003e — \u003ccite\u003eRob Pike[^1]\u003c/cite\u003e [^1]: The above quote is excerpted from Rob Pike's [talk](https://www.youtube.com/watch?v=PAAkCSZUG1c) during Gopherfest, November 18, 2015. Tables Tables are not part of the core Markdown specification, but Hugo supports them out of the box:\nName Age Bob 27 Alice 23 Markdown| Name | Age | |--------|------| | Bob | 27 | | Alice | 23 | Inline in Markdown tables Italics Bold Code italics bold code Markdown| Italics | Bold | Code | | -------- | -------- | ------ | | *italics* | **bold** | `code` | Code Block Syntax Highlighting List Ordered list First item Second item Third item Markdown1. First item 2. Second item 3. Third item Unordered list List item Another item And another item Markdown* List item * Another item * And another item Nested Lists Fruit Apple Orange Banana Dairy Milk Cheese Markdown* Fruit * Apple * Orange * Banana * Dairy * Milk * Cheese picture Markdown![landscape](https://picsum.photos/800/600) With title:\nUnsplash Landscape Markdown![landscape](https://picsum.photos/800/600 \"Unsplash Landscape\") The above quote is excerpted from Rob Pike’s talk during Gopherfest, November 18, 2015. ↩︎","md-reference#MD Reference":" Markdown Guide Markdown Cheatsheet Markdown Tutorial Markdown Reference "},"title":"Markdown Syntax"},"/en/about/docs/multi-language/":{"data":{"":"Qiandu supports creating multilingual websites using Hugo’s multilingual mode.","enable-multilingual-support#Enable multilingual support":"In order for Qiandu to support your language, you need to tell Hugo which languages ​​you need to support. Add this to Qiandu’s site configuration file:\nhugo.yamldefaultContentLanguage: en languages: en: languageName: English weight: 1 fr: languageName: Français weight: 2 ja: languageName: 日本語 weight: 3 ","manage-translations-by-file-name#Manage translations by file name":"Hugo supports managing translations by file name. For example, if we have an English file content/docs/_index.md, we can create a file content/docs/_index.fr.md translated to French.\ncontent docs _index.md _index.fr.md _index.ja.md Note: Hugo also supports managing translations by content directory.","more-references#More References":" Hugo Multilingual Mode Hugo Multilingual Part 1: Content translation - Hugo Multilingual Part 2: Strings localization ","translate-menu-items#Translate Menu Items":"To translate menu items in the navigation bar, we need to set the identifier field:\nhugo.yamlmenu: main: - identifier: documentation name: Documentation pageRef: /docs weight: 1 - identifier: blog name: Blog pageRef: /blog weight: 2 ","translate-strings#Translate Strings":"To translate strings elsewhere, we need to add the translations to the corresponding i18n file:\ni18n/fr.yamlreadMore: Lire la suite "},"title":"Multilingual"},"/en/about/docs/organize-files/":{"data":{"":"","configure-content-directory#Configure Content Directory":"If you need to use a different directory for your content, you can contact your administrator to set contentDir in the site configuration file to achieve this.","directory-introduction#Directory Introduction":"Directory Introduction By default, Qiandu is maintained based on Hugo, so the content searches for Markdown files in the content directory. The directory structure determines the final output structure of the website. For example: content _index.md docs _index.md getting-started.md guide _index.md organize-files.md blog _index.md post-1.md Each _index.md file is the index page of the corresponding section, and other Markdown files are regular pages.\ncontent ├── _index.md // \u003c- / ├── docs │ ├── _index.md // \u003c- /docs/ │ ├── getting-started.md // \u003c- /docs/getting-started/ │ └── guide │ ├── _index.md // \u003c- /docs/guide/ │ └── organize-files.md // \u003c- /docs/guide/organize-files/ └── blog ├── _index.md // \u003c- /blog/ └── post-1.md // \u003c- /blog/post-1/ ","sidebar-navigation#Sidebar Navigation":"The sidebar navigation is automatically generated based on the alphabetical order of the content organization. To manually configure the sidebar order, use the weight config in the frontmatter of the Markdown file.\ncontent/docs/guide/_index.md--- title: Guide weight: 2 --- ℹ️ It is recommended that the sidebar is not too deep. If there is too much content, consider breaking them into multiple sections. "},"title":"Organize Files"},"/en/about/docs/shortcodes/":{"data":{"":"Hugo shortcodes are simple snippets that call out built-in or custom templates in your content files.\nHextra provides a range of beautiful shortcodes to enhance your content.\nNotes Cards File Tree Icon Steps Tags "},"title":"Shortcodes"},"/en/about/docs/shortcodes/callout/":{"data":{"":"Built-in component that displays important information to the reader.","example#Example":" 👾 Callout is a short text that is designed to attract attention ℹ️ Callout is a short text that is designed to attract attention. ⚠️ Callout is a short text that is designed to attract attention. 🚫 Callout is a short text that is designed to attract attention. ","usage#Usage":"Default 🌐 Hugo can be used to create a variety of websites, including blogs, portfolios, documentation websites, etc. {{\u003c callout emoji=\"🌐\" \u003e}} Hugo can be used to create a variety of websites, including blogs, portfolios, documentation websites, etc. {{\u003c /callout \u003e}} Info ℹ️ Please visit GitHub to view the latest version {{\u003c callout type=\"info\" \u003e}} Please visit GitHub to view the latest version {{\u003c /callout \u003e}} Warning ⚠️ This API Will be deprecated in the next version {{\u003c callout type=\"warning\" \u003e}} **A callout** is a short text that is intended to attract attention {{\u003c /callout \u003e}} Error 🚫 Something went wrong, it’s going to explode {{\u003c callout type=\"error\" \u003e}} Something went wrong, it's going to explode {{\u003c /callout \u003e}} "},"title":"Callouts"},"/en/about/docs/shortcodes/cards/":{"data":{"":"","card-parameters#Card Parameters":" Parameter Description link URL (internal or external) title Title of the card subtitle Subtitle (supports Markdown) icon Name of the icon ","example#Example":" Callout Image CardQiandu Cards Local ImageQiandu Cards Local ImageQiandu Cards ","image-card#Image Card":"Additionally, the card supports adding images and processing via the following parameters:\nParameter Description image Specify the image URL for the card. method Sets Hugo’s image processing method. options Configure Hugo’s image processing options. Cards support three kinds of images:\nRemote images: the full URL should be placed in the image parameter\nStatic images: use a relative path from Hugo’s static/ directory\nProcessed images: use a relative path from Hugo’s assets/ directory\nHextra automatically detects whether an image needs processing during the build process and applies the options parameter or the default settings (scaled, 800x, quality 80, WebP format) as needed.\nIt currently supports the following processing methods: Resize, Fit, Fill, and Crop.\nFor more information on Hugo’s built-in image processing commands, methods, and options, see their Image Processing Documentation.","use#use":" {{\u003c/* cards */\u003e}} {{\u003c/* card link=\"../callout\" title=\"Callout\" icon=\"warning\" */\u003e}} {{\u003c/* card link=\"/\" title=\"No Icon\" */\u003e}} {{\u003c/* /cards */\u003e}} {{\u003c/* cards */\u003e}} {{\u003c/* card link=\"/\" title=\"Image Card\" image=\"https://source.unsplash.com/featured/800x600?landscape\" subtitle=\"Unsplash Landscape\" */\u003e}} {{\u003c/* card link=\"/\" title=\"Local Image\" image=\"/images/card-image-unprocessed.jpg\" subtitle=\"Raw image under static directory.\" */\u003e}} {{\u003c/* card link=\"/\" title=\"Local Image\" image=\"images/space.jpg\" subtitle=\"Image under assets directory, processed by Hugo.\" method=\"Resize\" options=\"600x q80 webp\" */\u003e}} {{\u003c/* /cards */\u003e}} "},"title":"Cards"},"/en/about/docs/shortcodes/details/":{"data":{"":"Built-in component for displaying collapsible content.","example#Example":" Details This is the content of the details\nMarkdown is supported.\nClick me to reveal This will be hidden by default ","usage#Usage":" {{%/* details title=\"Details\" */%}} This is the content of the details **support** Markdown {{%/* /details */%}} {{%/* details title=\"Click me to reveal\" closed=\"true\" */%}} This will be hidden by default {{%/* /details */%}} "},"title":"Details"},"/en/about/docs/shortcodes/filetree/":{"data":{"":"","example#Example":" content _index.md docs _index.md introduction.md introduction.fr.md hugo.toml ","usage#Usage":" Markdown{{\u003c/* filetree/container */\u003e}} {{\u003c/* filetree/folder name=\"content\" */\u003e}} {{\u003c/* filetree/file name=\"_index.md\" */\u003e}} {{\u003c/* filetree/folder name=\"docs\" state=\"closed\" */\u003e}} {{\u003c/* filetree/file name=\"_index.md\" */\u003e}} {{\u003c/* filetree/file name=\"introduction.md\" */\u003e}} {{\u003c/* filetree/file name=\"introduction.fr.md\" */\u003e}} {{\u003c/* /filetree/folder */\u003e}} {{\u003c/* /filetree/folder */\u003e}} {{\u003c/* filetree/file name=\"hugo.toml\" */\u003e}} {{\u003c/* /filetree/container */\u003e}} "},"title":"File Tree"},"/en/about/docs/shortcodes/icon/":{"data":{"":"To use this shortcode inline, you need to enable inline shortcodes in your config:\nhugo.yamlenableInlineShortcodes: true A list of available icons can be found in data/icons.yaml","examples#Examples":" ","usage#Usage":" {{\u003c/* icon \"github\" */\u003e}} Heroicons v1 outline icons out of the box\nHow to add your own icons Create a data/icons.yaml file and add your own SVG in the following format Icons:\ndata/icons.yamlyour-icon: \u003csvg\u003eyour icon svg content\u003c/svg\u003e You can then use it in a shortcode like this:\n{{\u003c/* icon \"your-icon\" */\u003e}} {{\u003c/* card icon=\"your-icon\" */\u003e}} Tip: Iconify Design is a great place to find SVG icons for your site"},"title":"Icon"},"/en/about/docs/shortcodes/steps/":{"data":{"":"A built-in component to display a series of steps.","example#Example":" Step 1 This is the first step.\nStep 2 This is the second step.\nStep 3 This is the third step.","usage#Usage":"Put a Markdown h3 title inside the steps shortcode.\n{{%/* steps */%}} ### Step 1 This is the first step. ### Step 2 This is the second step. {{%/* /steps */%}} "},"title":"steps"},"/en/about/docs/shortcodes/tabs/":{"data":{"":"","example#Example":" JSONYAMLTOML JSON: JavaScript Object Notation (JSON) is a standard text-based format for representing structured data based on JavaScript object syntax. YAML: YAML is a human-readable data serialization language. TOML: TOML aims to be a minimal configuration file format that’s easy to read due to obvious semantics. ","usage#Usage":"By default {{\u003c tabs items=\"JSON,YAML,TOML\" \u003e}} {{\u003c tab \u003e}}**JSON**: JavaScript Object Notation (JSON) is a standard text-based format for representing structured data based on JavaScript object syntax.{{\u003c /tab \u003e}} {{\u003c tab \u003e}}**YAML**: YAML is a human-readable data serialization language.{{\u003c /tab \u003e}} {{\u003c tab \u003e}}**TOML**: TOML aims to be a minimal configuration file format that's easy to read due to obvious semantics.{{\u003c /tab \u003e}} {{\u003c /tabs \u003e}} Specify the index Use the defaultIndex property to specify the selected tab. The index starts at 0.\n{{\u003c tabs items=\"JSON,YAML,TOML\" defaultIndex=\"1\" \u003e}} {{\u003c tab \u003e}}**JSON**: JavaScript Object Notation (JSON) is a standard text-based format for representing structured data based on JavaScript object syntax.{{\u003c /tab \u003e}} {{\u003c tab \u003e}}**YAML**: YAML is a human-readable data serialization language.{{\u003c /tab \u003e}} {{\u003c tab \u003e}}**TOML**: TOML aims to be a minimal configuration file format that's easy to read due to obvious semantics.{{\u003c /tab \u003e}} {{\u003c /tabs \u003e}} Defaults to YAML\nJSONYAMLTOML JSON: JavaScript Object Notation (JSON) is a standard text-based format for representing structured data based on JavaScript object syntax. YAML: YAML is a human-readable data serialization language. TOML: TOML aims to be a minimal configuration file format that’s easy to read due to obvious semantics. Using Markdown Also supports Markdown syntax including code blocks:\n{{\u003c tabs items=\"JSON,YAML,TOML\" \u003e}} {{\u003c tab \u003e}} ```json { \"hello\": \"world\" } ``` {{\u003c /tab \u003e}} ... add other tabs similarly {{\u003c /tabs \u003e}} JSONYAMLTOML { \"hello\": \"world\" } hello: world hello = \"world\" "},"title":"Tabs"},"/en/about/docs/syntax-highlighting/":{"data":{"":"Qiandu uses Chroma, a pure Golang implementation of code highlighting renderer. It is recommended to use backticks for code blocks in Markdown content, for example:\nMarkdown```python def say_hello(): print(\"Hello!\") ``` Will be rendered as:\ndef say_hello(): print(\"Hello!\") ","features#Features":"Filename To add a filename or title to a code block, set filename:\nMarkdown```python {filename=\"hello.py\"} def say_hello(): print(\"Hello!\") ``` hello.pydef say_hello(): print(\"Hello!\") Line Numbers To set line numbers, set linenos to table, and set linenostart to the starting line number:\nMarkdown```python {linenos=table,linenostart=42} def say_hello(): print(\"Hello!\") ``` 42 43 def say_hello(): print(\"Hello!\") Highlight Lines Display highlighted lines, set hl_lines to line numbers:\nMarkdown```python {linenos=table,hl_lines=[2,4],linenostart=1,filename=\"hello.py\"} def say_hello(): print(\"Hello!\") def main(): say_hello() ``` hello.py 1 2 3 4 5 def say_hello(): print(\"Hello!\") def main(): say_hello() Copy button By default, the code block copy button is automatically enabled.","supported-programming-languages#Supported programming languages":"For more information about supported programming languages, go to Chroma’s documentation."},"title":"Syntax Highlighting"},"/en/about/privacy/":{"data":{"":"","#":"1. Introduction We are committed to protecting your privacy. This privacy agreement is intended to explain how we collect, use, disclose and protect the personal information you provide when using QianDu.\n2. Information Collection We will not and cannot collect important information such as your name, email address, IP address, etc.; in addition, as community maintainers, community members also have corresponding obligations and responsibilities not to disclose your GitHub account.\n3. Information Disclosure We will not disclose your personal information to any third party, without any special circumstances, because the original intention of QianDu is to create a privacy technology exchange community.\n4. Information Security As you know, QianDu runs in a local Pages mode, so we will not collect any information.\n5. Contact Security If you contact QianDu’s Telegram when you need QianDu-related services, we will not disclose your Telegram account, but please move to Telegram to read the privacy agreement related to Telegram.\nSummary: This privacy agreement clarifies QianDu’s regulations on the collection, use, disclosure and protection of user personal information to protect user privacy rights."},"title":"Privacy Policy"},"/en/blog/":{"data":{"":" RSS Feed Blog Think what you want, recommend what you want to see "},"title":"Blog"},"/en/security/":{"data":{"":" Cybersecurity Consulting Services Depending on your business needs, Qiandu can provide single security consulting servicesor a full package of network security consulting services. Contact us Penetration Testing A professional security team with more than 10 years of practical penetration experience will personally help you diagnose the vulnerabilities of your system. They will completely simulate the behavior of hackers, conduct in-depth penetration tests on customer websites, discover and give repair suggestions to form professional reports, and help customers truly solve security problems.\nTraceability Based on the clues provided by the customer, we trace the source of malicious network behaviors (false reports, malicious slander, information leaks, hacker attacks, etc.) that have occurred or are occurring against the customer’s network and IT system.\nEmergency Response Relying on Qiandu’s many years of practical security attack and defense technical capabilities and management experience, and referring to relevant international information security incident response standards, we help users to follow the prevention, intelligence information collection, containment, eradication, and recovery process after a security incident occurs, and provide professional 7*24远程紧急响应处理服务。\nSecurity Consultant We serve as your safety consultant, answering your safety questions, assessing safety risks, and making safety decisions. We assist in establishing internal safety regulations, employee safety awareness training, and technical personnel special safety training.\nSafety Construction Fear of being hacked, database being dragged, and hijacked are the most direct driving forces for security construction. Qiandu helps you gradually build a security system from scratch, effectively reduce the occurrence of security incidents, and effectively ensure basic security and business security.\nSecurity strategy development Analyze business goals, organizational structure and technical environment to develop a practical cybersecurity strategy. Provide a clear development blueprint to ensure continuous improvement of the organization’s cybersecurity.\nEnterprise security architecture design Based on the security strategies and business needs of government and enterprises, we design a comprehensive enterprise security architecture, including security business architecture, security technology architecture, and security application architecture, to ensure that the needs are met.\nSafety engineering planning Based on the enterprise security architecture, we plan specific security engineering projects to achieve the network security goals of government and enterprise customers, determine project priorities, allocate resources, and develop implementation plans."},"title":"Cybersecurity Consultant"},"/en/service/":{"data":{"":" Cooperation with Qiandu, Discover endless possibilities Qiandu attaches great importance to the privacy and security of customers. We promise that we will never disclose customer information. We aim to provide you with tailor-made solutions to meet your unique needs in many fields, including website development, network security, commercial marketing, blockchain, payment and guaranteed transactions. Web3 Blockchain Services QianDu provides consulting, development and other services for blockchain, NFT, Metaverse, cryptocurrency, decentralized exchanges/wallets and other industry chains\nCybersecurity Consultant Qiandu has a very professional security team that can provide single security consulting services or a full package of network security consulting services based on your business needs.\nNetwork and Application QianDu provides professional network and application customization services. You only need to provide the requirements document and your budget, and we will evaluate the duration and feasibility within 24 hours.\nSecured Transactions Qiandu is a guarantee company with a bottom line. Whether you are a service provider or a customer, our professionals will always help meet your guarantee privacy. We only provide guarantee services.\nBusiness Marketing Consultant QianDu provides you with marketing solutions for all platforms including Google, FaceBook, X, Instagram, TikTok, Youtube, etc.\nFinished software transactions QianDu relies on closed source and commercial customer delivered products from hundreds of developers. We can provide almost all the commercial software you need.\n24-hour Service No matter what problems you encounter, QianDu can help you solve them.\nContact Us "},"title":"Service"},"/en/web3/":{"data":{"":"","#":" Explore the infinite possibilities of Web3 blockchain Deploy web3 blockchain services. Leading the new trend of future digital economy Contact Us Token issuance We provide full-service support including token issuance, token official website development, decentralized virtual currency exchange development, virtual currency wallet development, token listing, etc.\nNTF Provide full-time accompanying services such as NTF issuance, NTF official website development, NTF exchange receipts, NTF wallet management, and NTF listing.\nMetaverse Project development in the fields of Metaverse, VR, AR/MR, etc.\nWeb3 blockchain technology is reshaping the world. Our studio is committed to providing you with a full range of professional services, covering blockchain, NFT, metaverse, cryptocurrency, decentralized exchanges/wallets and other industrial chains. Service We have an experienced team of experts who conduct in-depth research and practice in these cutting-edge fields. Whether you need advice on blockchain technology, or want to develop innovative NFT projects, or create an immersive metaverse experience, or even build a safe and reliable decentralized exchange and wallet, we can provide you with accurate, efficient and professional solutions.\nCooperation process Demand communication: You have initial contact with our team and elaborate on your needs and expectations in blockchain, NFT, metaverse, decentralized exchanges/wallets, etc.\nSolution customization: We conduct in-depth market research and technical analysis based on your needs to tailor a unique solution for you.\nAgreement signing: After the two parties reach an agreement on the plan, they sign a cooperation agreement that binds the cooperation content of both parties and clarifies the rights and obligations of both parties.\nPayment of start-up funds: Pay QianDu a start-up fund of no less than 50% of the total project amount.\nProject launch: Form a professional project team, develop a detailed project plan and schedule, and officially launch the project.\nRegular communication: During the project, we maintain regular communication, report the project progress to you in a timely manner, and listen to your opinions and suggestions.\nResults delivery: Deliver the project results to you according to the time and standards agreed in the contract, and provide relevant technical support and training.\nPay the balance: Pay the remaining amount of the project cooperation\nAfter-sales service: After the project is delivered, we provide continuous after-sales service to ensure the stable operation and optimization and upgrading of the project."},"title":"web3 blockchain services"}}