{"/es/about/":{"data":{"":"","cómo-utilizar-qiandu#Cómo utilizar QianDu":"","el-compromiso-de-qiandu#El compromiso de QianDu":"","la-historia-de-qiandu#La historia de QianDu":"","método-de-pago-qiandu#Método de pago QianDu":"¿Qué es QianDu?\rQianDu es una comunidad que protege al 100% la privacidad del usuario. Los usuarios y desarrolladores pueden intercambiar o recomendar cualquier producto digital, servicio técnico, API y otros negocios sin restricciones de la industria en la plataforma.\nLa comunidad promete que cualquier desarrollador que pueda ingresar a la comunidad debe ser un profesional de la industria que haya pagado un depósito o tenga una gran experiencia.\nLa historia de QianDu\rEl predecesor de QianDu fue un conocido foro chino. Después de que el fundador X falleciera por razones especiales, sus seguidores Jack Tang, Mark Chen y Andy Musk invirtieron y fundaron QianDu.\nQianDu fundada es una comunidad de desarrollo que concede gran importancia a la privacidad en Internet y funciona con el apoyo y la experiencia de muchos socios en todo el mundo.\nDurante años, nos hemos comprometido a brindar soluciones confiables y confiables de la manera más privada, para que realmente podamos marcar la diferencia para nuestros usuarios.\nComo equipo remoto y autónomo, no estamos sujetos a ninguna política ni requisito de los inversores. Esta libertad nos permite ser flexibles para cambiar y centrarnos en lo que realmente más importa: nuestros usuarios.\nEl equipo fundador comenzó en la industria de servicios de privacidad en 2008 sin capital de riesgo ni financiación externa. Cada servicio que desarrollamos y cada decisión que tomamos se considera cuidadosamente y se centra en el usuario. El camino recorrido a lo largo de los años no siempre ha sido fácil, pero sí muy gratificante.\nTomamos decisiones basadas en lo que es mejor para sus necesidades, no en lo que es mejor para la junta directiva.\nAndy Musk: Espero que nuestros usuarios puedan tener verdadera libertad, y todo lo que tenemos que hacer es ayudarlos (las palabras de A en la reunión de todo el personal realmente representan los pensamientos de todos nosotros)\nCómo utilizar QianDu\rIncorpóreo no significa restringido.\nDe hecho, este es nuestro superpoder. Nuestro pequeño tamaño, seguro y capaz de brindar servicios 1V1/0V1, nos permite movernos más rápido y con mayor capacidad de respuesta, y contamos con socios de todo el mundo que trabajan de forma remota para brindarle todo lo que necesita.\nCuando usa QianDu, no solo está usando una plataforma; está interactuando con nuestra pasión y visión para construir una plataforma de servicios que sea poderosa, confiable y extremadamente segura.\nEl compromiso de QianDu\rEstamos profundamente conectados con nuestros usuarios.\nCada correo electrónico, pregunta o comentario que envía es leído y respondido por una persona real: no un robot, ni un equipo de soporte subcontratado, sino un ser humano en el corazón de QianDU.\nEstamos comprometidos a brindar un servicio que resuelva sus problemas y brinde una experiencia fluida y confiable.\nValores de QianDu\rConfiabilidad: Con años de experiencia en la industria, entendemos la naturaleza crítica de nuestro trabajo. La mayoría de los miembros de nuestro equipo remoto incluyen los mejores talentos de Silicon Valley, Nueva Delhi, India y Zhongguancun, Beijing. Transparencia: Creemos en la comunicación abierta. QianDu nos permite ser honestos acerca de nuestras capacidades y limitaciones, y siempre nos esforzamos por superar sus expectativas. Responsabilidad: Ser administrado principalmente por QianDu significa que somos responsables de todos los aspectos de los servicios de los miembros de nuestro equipo. Respaldamos nuestro trabajo y asumimos la responsabilidad de nuestros éxitos y errores. Innovación: Siempre estamos buscando formas de mejorar e innovar. Nuestra estructura ágil nos permite implementar rápidamente nuevas ideas y responder a las necesidades de los usuarios. Estilo personal: Creemos en el poder de las relaciones. Cuando trabaja con QianDu, es más que un simple cliente: interactúa directamente con las personas detrás del producto. Gracias por elegir QianDu y apoyar a la comunidad de desarrollo independiente.\nDurante dieciséis años, hemos estado creciendo y desarrollándonos, y esperamos continuar este viaje con usted, mejorando constantemente nuestros servicios y convirtiéndonos en su socio de confianza en el campo de Internet.\nMétodo de pago QianDu\rQianDu solo admite el uso de BTC y USDT para pagar los servicios proporcionados por QianDu, y cambiaremos la dirección de pago después de un período de tiempo. Consulte la dirección de billetera publicada aquí:\nBTC: bc1plklsdytnfk2elhd00gg5r08e3cdye6j96cr4etpnd0crgpnuzr6s69hgqj\nUSDT(ERC20): 0xE40E0dc445BA8D6C7db0318cC48D34556457FE13\nUSDT(TRC20): TUXiSG7EVk1rrc9pQzCLe6W1P3btvnB7Dm","qué-es-qiandu#¿Qué es QianDu?":"","valores-de-qiandu#Valores de QianDu":""},"title":"Acerca de QianDu"},"/es/about/contact/":{"data":{"":"","puedo-unirme-a-qiandu#¿Puedo unirme a QianDu?":"","qué-puedo-hacer-al-unirme-a-qiandu#¿Qué puedo hacer al unirme a QianDu?":"Hola ~ ¡Me alegro de conocerte en QianDu y espero que te unas pronto a QianDu!\nContáctenos\r¿Puedo unirme a QianDu?\rPor supuesto, damos la bienvenida a desarrolladores/blogueros preocupados por la privacidad de todo el mundo para que se unan a nosotros. Después de unirse a la familia QianDu, definitivamente obtendrá más en términos de conexiones e ingresos.\n¿Qué puedo hacer al unirme a QianDu?\rPuede proporcionar servicios a los visitantes de QianDu:\nWeb y aplicaciones Consultor de Seguridad Cibernética Servicio de pago transacción segura consultor de marketing empresarial Servicio de cadena de bloques Web3 comercio de software También puedes participar en el mantenimiento de contenidos de QianDu.\nblog Navegación de herramientas de comercio transfronterizo Navegación de la herramienta Blockchain Navegación con herramientas de IA Navegación de herramientas "},"title":"Únete a la comunidad"},"/es/about/docs/":{"data":{"":"Explore las siguientes secciones para aprender cómo participar en el mantenimiento de la comunidad Qiandu:\nEstructura del directorio\rConfiguración\rreducción\rresaltado de código\rfórmula de látex\rcuadro\rcódigo corto"},"title":"Guía de mantenimiento comunitario"},"/es/about/docs/configuration/":{"data":{"":"","barra-de-navegación#Barra de navegación":"","barra-lateral#Barra lateral":"","barra-lateral-derecha#Barra lateral derecha":"","footer#Footer":"","otro#otro":"Qiandu lee la configuración de hugo.yaml en el directorio raíz del sitio web de Hugo. En el archivo de configuración puede configurar todas las opciones para su sitio. Puede encontrar el archivo de configuración de este sitio en exampleSite/hugo.yaml para comenzar.\nBarra de navegación\rmenú\rEl menú en la esquina superior derecha está configurado en menu.main del archivo de configuración:\nhugo.yamlmenu: main: - name: Documentation pageRef: /docs weight: 1 - name: Blog pageRef: /blog weight: 2 - name: About pageRef: /about weight: 3 - name: Search weight: 4 params: type: search - name: GitHub weight: 5 url: \"\" params: icon: github\rHay varios tipos diferentes de elementos de menú:\nLink to a page in the site with pageRef - name: Documentation pageRef: /docs\rLink to an external URL with url - name: GitHub url: \"https://github.com\"\rSearch bar with type: search - name: Search params: type: search\rIcon - name: GitHub params: icon: github\rEstos elementos del menú se pueden ordenar configurando “peso”.\nBarra lateral\rBarra lateral principal\rLa barra lateral principal se genera automáticamente a partir de la estructura del directorio content. Para obtener más detalles, vaya a Estructura del directorio.\nEnlaces adicionales\rLos enlaces adicionales para la barra lateral se configuran en la sección menu.sidebar del archivo de configuración:\nhugo.yamlmenu: sidebar: - name: More params: type: separator weight: 1 - name: \"About\" pageRef: \"/about\" weight: 2 - name: \"Docs ↗\" url: \"https://gohugo.io/name/\" weight: 3\rBarra lateral derecha\rTabla de contenido\rLa tabla de contenido se genera automáticamente en función de los títulos del archivo de contenido; esto se puede desactivar configurando toc: false en front matter.\ncontent/docs/guide/configuration.md--- title: Configuration toc: false ---\rEditar el enlace de esta página\rPara configurar el enlace editar esta página, podemos configurar params.editURL.base en el archivo de configuración:\nhugo.yamlparams: editURL: base: \"https://github.com/your-username/your-repo/edit/main\"\rLos enlaces de edición se generarán automáticamente para cada página. Para configurar un enlace de edición para una página específica, puede configurar editURL en la front matter de la página:\ncontent/docs/guide/configuration.md--- title: Configuration editURL: \"https://example.com/edit/this/page\" ---\rFooter\rDeclaración de derechos de autor\rPara modificar el texto de derechos de autor que aparece en el pie de página de su sitio web, deberá crear un archivo llamado “i18n/en.yaml”. En este archivo, complete el nuevo texto de derechos de autor, así:\ni18n/en.yamlcopyright: \"© 2024 Qiandu.org\"\rPuede encontrar el archivo de ejemplo i18n/en.yaml en el repositorio de GitHub. Además, puede utilizar el formato Markdown en el texto con derechos de autor.\notro\rfavicon\rSi necesita personalizar favicon, coloque el archivo del icono en la carpeta static para anular el [favicon predeterminado en el tema](https:// github.com/imfing/hextra/tree/main/static):\nstatic\randroid-chrome-192x192.png\randroid-chrome-512x512.png\rapple-touch-icon.png\rfavicon-16x16.png\rfavicon-32x32.png\rfavicon-dark.svg\rfavicon.ico\rfavicon.svg\rsite.webmanifest\rIncluya los archivos favicon.ico y favicon.svg en su proyecto para garantizar que el favicon del sitio web se muestre correctamente.\nSi bien favicon.ico generalmente funciona en navegadores más antiguos, favicon.svg es compatible con los navegadores modernos, por lo que un enfoque más moderno sería agregar favicon-dark.svg para funcionar mejor en la experiencia del modo oscuro.\nNo dudes en utilizar herramientas como favicon.io o favycon para generar estos íconos.\nConfiguración del tema de color\rUtilice la configuración de “tema” para configurar el modo de tema predeterminado y el botón de alternancia que permite a los visitantes cambiar entre el modo claro u oscuro.\nhugo.yamlparams: theme: # light | dark | system default: system displayToggle: true\rOpciones para theme.default:\nlight - solo usa el modo ligero dark: solo usa el modo de apariencia system - sigue el sistema theme.displayToggle controla la visualización de botones de alternancia para cambiar temas. Cuando se establece en “verdadero”, los visitantes pueden cambiar entre el modo claro u oscuro, anulando la configuración predeterminada.\nAncho de página\rEl ancho de la página se puede ajustar mediante el parámetro params.page.width en el archivo de configuración:\nhugo.yamlparams: page: # full (100%), wide (90rem), normal (1280px) width: wide\rHay tres opciones: full, wide y normal. El modo de ancho de página predeterminado es normal.\nDe manera similar, el ancho de la barra de navegación y el footer también se pueden ajustar mediante params.navbar.width y params.footer.width.\nbuscar\rLa búsqueda de texto completo proporcionada por FlexSearch está habilitada de forma predeterminada. Para personalizar el índice de búsqueda, configure params.search.flexsearch.index en el archivo de configuración:\nhugo.yamlparams: # Search search: enable: true type: flexsearch flexsearch: # index page by: content | summary | heading | title index: content\rOpciones para flexsearch.index:\ncontent - búsqueda de contenido completo summary - Descripción general Resúmenes de contenido de Hugo heading - títulos de primer y segundo nivel title - busca solo el título Para personalizar la tokenización de búsqueda, configure params.search.flexsearch.tokenize en el archivo de configuración:\nparams: # ... flexsearch: # full | forward | reverse | strict tokenize: forward\rflexsearch.tokenize opciones:\nstrict - coincidencia estricta de palabras forward - coincidencia de prefijos de palabras reverse - coincidencia de prefijos y sufijos de palabras full: coincidencia de subcadenas de palabras. Según la lógica de segmentación de palabras predeterminada, una oración china es una “palabra”\nPara excluir una página del índice de búsqueda, cambie excludeSearch: true al principio:\ncontent/docs/guide/configuration.md--- title: Configuration excludeSearch: true ---\rGoogle Analytics\rPara habilitar Google Analytics, configure services.googleAnalytics.ID:\nhugo.yamlservices: googleAnalytics: ID: G-MEASUREMENT_ID"},"title":"Archivo de configuración"},"/es/about/docs/deploy-site/":{"data":{"":"","cloudflare#Cloudflare":"","github-pages#GitHub Pages":"","netlificar#Netlificar":"","vercel#Vercel":"Qiandu genera sitios estáticos localmente y ha implementado múltiples métodos de alojamiento para sincronizar y admitir el acceso de los usuarios. Puede solicitar permisos de sincronización después de unirse a nuestro Github, sus modificaciones se sincronizarán con el mundo en un instante.\nGitHub Pages\rNodo maestro de GitHubqiandu.org\nNodo de respaldo de GitHub: qianduorg.github.io\nCloudflare\rNodo maestro de Cloudflaredev.qiandu.org\nNodo de respaldo de Cloudflare: qiandu.pages.dev\nNetlificar\rEntrada temporalmente abierta\nVercel\rEntrada temporalmente abierta"},"title":"Visita qiandu.org"},"/es/about/docs/diagrams/":{"data":{"":"","mermaid#Mermaid":"Actualmente, Qiandu admite el gráfico de [Mermaid] (#mermaid).\nMermaid\r[Mermaid] (https://github.com/mermaid-js/mermaid#readme) es una herramienta de dibujo de gráficos basada en JavaScript. Su definición de texto es similar a Markdown y puede crear gráficos dinámicamente en el navegador. Por ejemplo: diagrama de flujo, diagrama de secuencia, gráfico circular, etc.\nUsar Mermaid en Hextra es tan fácil como usar bloques de código:\n```mermaid graph TD; A--\u003eB; A--\u003eC; B--\u003eD; C--\u003eD; ```\rse representará como:\ngraph TD;\rA--\u003eB;\rA--\u003eC;\rB--\u003eD;\rC--\u003eD;Sequence diagram：\nsequenceDiagram\rparticipant Alice\rparticipant Bob\rAlice-\u003e\u003eJohn: Hello John, how are you?\rloop Healthcheck\rJohn-\u003e\u003eJohn: Fight against hypochondria\rend\rNote right of John: Rational thoughts prevail!\rJohn--\u003e\u003eAlice: Great!\rJohn-\u003e\u003eBob: How about you?\rBob--\u003e\u003eJohn: Jolly good!Para obtener más información, vaya a Mermaid Documentation."},"title":"cuadro"},"/es/about/docs/latex/":{"data":{"":"","ejemplo#Ejemplo":"","expresión-química#Expresión química":"$\\KaTeX$ Para representar expresiones matemáticas de LaTeX. Se puede habilitar estableciendo math en true en frontmatter.\nMarkdown--- title: \"My Page with LaTeX\" math: true ---\rCuando esté habilitado, los scripts, hojas de estilo y fuentes de KaTeX se incluirán automáticamente en su sitio web. Esto le permite utilizar expresiones matemáticas de LaTeX en el contenido de Markdown.\nEjemplo\rEl contenido de Markdown admite expresiones matemáticas de LaTeX tanto en línea como en párrafos independientes.\nEn línea\rpage.mdThis $\\sigma(z) = \\frac{1}{1 + e^{-z}}$ is inline.\rThis $\\sigma(z) = \\frac{1}{1 + e^{-z}}$ is inline.\nPárrafo independiente\rpage.md$$F(\\omega) = \\int_{-\\infty}^{\\infty} f(t) e^{-j\\omega t} \\, dt$$\rse representará como:\n$$F(\\omega) = \\int_{-\\infty}^{\\infty} f(t) e^{-j\\omega t} , dt$$\nFunciones soportadas\rPara obtener una lista de símbolos admitidos, vaya a Fórmulas admitidas por KaTeX.\nExpresión química\rLas expresiones químicas se admiten a través de mhchem.\nEn línea: $\\ce{H2O}$ es agua.\nPárrafo independiente:\npage.md$$\\ce{Hg^2+ -\u003e[I-] HgI2 -\u003e[I-] [Hg^{II}I4]^2-}$$\r$$\\ce{Hg^2+ -\u003e[I-] HgI2 -\u003e[I-] [Hg^{II}I4]^2-}$$","funciones-soportadas#Funciones soportadas":""},"title":"fórmula de látex"},"/es/about/docs/markdown/":{"data":{"":"","configuración#Configuración":"","markdown-conceptos-básicos#Markdown Conceptos básicos":"","referencias-médicas#Referencias médicas":"Qiandu admite Markdown para escribir contenido, crear listas, etc. Esta página le mostrará algunos de los ejemplos de sintaxis de Markdown más comunes utilizados por Qiandu.\nMarkdown Conceptos básicos\rEstilo de texto\rStyle Syntax Example Output Bold **bold text** **bold text** bold text Italic *italicized text* `italicized text italicized text Strikethrough ~~strikethrough text~~ ~~strikethrough text~~ strikethrough text Subscript \u003csub\u003e\u003c/sub\u003e This is a \u003csub\u003esubscript\u003c/sub\u003e text This is a subscript text Superscript \u003csup\u003e\u003c/sup\u003e This is a \u003csup\u003esuperscript\u003c/sup\u003e text This is a superscript text Cita\rCitas en bloque con subíndices:\nDon’t communicate by sharing memory, share memory by communicating.\n— Rob Pike1\nMarkdown\u003e Don't communicate by sharing memory, share memory by communicating.\u003cbr\u003e \u003e — \u003ccite\u003eRob Pike[^1]\u003c/cite\u003e [^1]: The above quote is excerpted from Rob Pike's [talk](https://www.youtube.com/watch?v=PAAkCSZUG1c) during Gopherfest, November 18, 2015.\rhoja\rLas tablas no son una especificación central de Markdown, pero Hugo admite tablas listas para usar:\nName Age Bob 27 Alice 23 Markdown| Name | Age | |--------|------| | Bob | 27 | | Alice | 23 |\rEn línea en la tabla Markdown\rItalics Bold Code italics bold code Markdown| Italics | Bold | Code | | -------- | -------- | ------ | | *italics* | **bold** | `code` |\rBloque de código\rSyntax Highlighting\rLista\rLista ordenada\rFirst item Second item Third item Markdown1. First item 2. Second item 3. Third item\rLista desordenada\rList item Another item And another item Markdown* List item * Another item * And another item\rLista anidada\rFruit Apple Orange Banana Dairy Milk Cheese Markdown* Fruit * Apple * Orange * Banana * Dairy * Milk * Cheese\rimagen\rMarkdown![landscape](https://picsum.photos/800/600)\rCon título:\nUnsplash Landscape\rMarkdown![landscape](https://picsum.photos/800/600 \"Unsplash Landscape\")\rConfiguración\rQiandu usa Goldmark para analizar Markdown. La representación de Markdown se puede configurar contactando al administrador de la comunidad en markup.goldmark en hugo.yaml. La siguiente es la configuración predeterminada de Qiandu:\nhugo.yamlmarkup: goldmark: renderer: unsafe: true highlight: noClasses: false\rPara obtener más opciones, vaya a Configure Markup.\nReferencias médicas\rGuía de Markdown Hoja de referencia deMarkdown Tutorial deMarkdown Referencia deMarkdown The above quote is excerpted from Rob Pike’s talk during Gopherfest, November 18, 2015. ↩︎"},"title":"Markdown gramática"},"/es/about/docs/multi-language/":{"data":{"":"","administrar-traducciones-por-nombre-de-archivo#Administrar traducciones por nombre de archivo":"","habilitar-soporte-en-varios-idiomas#Habilitar soporte en varios idiomas":"","más-referencias#Más referencias":"Qiandu admite el uso del [modo multilingüe] de Hugo (https://gohugo.io/content-management/multilingual/) para crear sitios web multilingües.\nHabilitar soporte en varios idiomas\rPara que Qiandu admita su idioma, debe decirle a Hugo qué idiomas deben ser compatibles. Agregue el archivo de configuración del sitio de Qiandu:\nhugo.yamldefaultContentLanguage: en languages: en: languageName: English weight: 1 fr: languageName: Français weight: 2 ja: languageName: 日本語 weight: 3\rAdministrar traducciones por nombre de archivo\rHugo admite la gestión de traducciones por nombre de archivo. Por ejemplo, si tenemos un archivo en inglés content/docs/_index.md, podemos crear un archivo traducido al francés content/docs/_index.fr.md.\ncontent\rdocs\r_index.md\r_index.fr.md\r_index.ja.md\rNota: Hugo también admite la traducción por directorio de contenido (https://gohugo.io/content-management/multilingual/#translation-by-content-directory).\nTraducir elementos del menú\rPara traducir elementos del menú en la barra de navegación, necesitamos configurar el campo identifier:\nhugo.yamlmenu: main: - identifier: documentation name: Documentation pageRef: /docs weight: 1 - identifier: blog name: Blog pageRef: /blog weight: 2\rTraducir cadena\rPara traducir cadenas en otro lugar, necesitamos agregar la traducción al archivo i18n correspondiente:\ni18n/fr.yamlreadMore: Lire la suite\rMás referencias\rHugo Multilingual Mode Hugo Multilingual Part 1: Content translation Hugo Multilingual Part 2: Strings localization ","traducir-cadena#Traducir cadena":"","traducir-elementos-del-menú#Traducir elementos del menú":""},"title":"plurilingüe"},"/es/about/docs/organize-files/":{"data":{"":"","configurar-directorio-de-contenido#Configurar directorio de contenido":"Introducción al directorio\rDe forma predeterminada, Qiandu se mantiene en función de Hugo, por lo que el contenido se busca en archivos Markdown en el directorio content. La estructura del directorio determina la estructura de salida final del sitio web. Por ejemplo:\ncontent\r_index.md\rdocs\r_index.md\rgetting-started.md\rguide\r_index.md\rorganize-files.md\rblog\r_index.md\rpost-1.md\rCada archivo _index.md es una página de índice para la sección correspondiente, y otros archivos Markdown son páginas normales.\ncontent\r├── _index.md // \u003c- /\r├── docs\r│ ├── _index.md // \u003c- /docs/\r│ ├── getting-started.md // \u003c- /docs/getting-started/\r│ └── guide\r│ ├── _index.md // \u003c- /docs/guide/\r│ └── organize-files.md // \u003c- /docs/guide/organize-files/\r└── blog\r├── _index.md // \u003c- /blog/\r└── post-1.md // \u003c- /blog/post-1/\rNavegación de la barra lateral\rLa navegación de la barra lateral se genera automáticamente según el orden alfabético en el que está organizado el contenido. Para configurar manualmente el orden de la barra lateral, puede usar la configuración de weight en el frontmatter del archivo Markdown.\ncontent/docs/guide/_index.md--- title: Guide weight: 2 ---\rℹ️\rSe recomienda que la barra lateral no sea demasiado profunda. Si hay demasiado contenido, considere dividirlo en varias partes.\rConfigurar directorio de contenido\rSi necesita utilizar un directorio diferente para el contenido, puede comunicarse con el administrador para configurar contentDir en el archivo de configuración del sitio para lograrlo.","introducción-al-directorio#Introducción al directorio":"","navegación-de-la-barra-lateral#Navegación de la barra lateral":""},"title":"Estructura del directorio"},"/es/about/docs/shortcodes/":{"data":{"":"Los códigos cortos de Hugo son fragmentos simples en sus archivos de contenido que llaman a plantillas integradas o personalizadas.\nHextra ofrece una colección de hermosos códigos cortos para mejorar tu contenido.\nCosas a tener en cuenta\rtarjeta\rÁrbol de archivos\ricono\rpaso\rEtiqueta"},"title":"código corto"},"/es/about/docs/shortcodes/callout/":{"data":{"":"","example#Example":"","usage#Usage":"Componente incorporado que muestra información importante a los lectores.\nExample\r👾\rAnotación es un breve fragmento de texto diseñado para atraer la atención.\rℹ️\rAnotación es un breve fragmento de texto diseñado para atraer la atención.。\r⚠️\rAnotación es un breve fragmento de texto diseñado para atraer la atención.。\r🚫\rAnotación es un breve fragmento de texto diseñado para atraer la atención.。\rUsage\rDefault\r🌐\rHugo se puede utilizar para crear una variedad de sitios web, incluidos blogs, portafolios, sitios de documentación y más.\r{{\u003c callout emoji=\"🌐\" \u003e}} Hugo se puede utilizar para crear una variedad de sitios web, incluidos blogs, portafolios, sitios de documentación y más. {{\u003c /callout \u003e}}\rInfo\rℹ️\rVisite GitHub para ver la última versión.\r{{\u003c callout type=\"info\" \u003e}} Visite GitHub para ver la última versión. {{\u003c /callout \u003e}}\rWarning\r⚠️\rEsta API quedará obsoleta en la próxima versión.\r{{\u003c callout type=\"warning\" \u003e}} Un **texto** es un breve fragmento de texto diseñado para atraer la atención. {{\u003c /callout \u003e}}\rError\r🚫\rAlgo salió mal, va a explotar.\r{{\u003c callout type=\"error\" \u003e}} Algo salió mal, va a explotar. {{\u003c /callout \u003e}}"},"title":"marca"},"/es/about/docs/shortcodes/cards/":{"data":{"":"","ejemplo#Ejemplo":"","image-card#Image Card":"Ejemplo\rCallout\rImage CardQiandu Cards\rLocal ImageQiandu Cards\rLocal ImageQiandu Cards\rusar\r{{\u003c cards \u003e}}\r{{\u003c card link=\"../callout\" title=\"Callout\" icon=\"warning\" \u003e}}\r{{\u003c card link=\"/\" title=\"No Icon\" \u003e}}\r{{\u003c /cards \u003e}}\r{{\u003c cards \u003e}}\r{{\u003c card link=\"/\" title=\"Image Card\" image=\"https://source.unsplash.com/featured/800x600?landscape\" subtitle=\"Unsplash Landscape\" \u003e}}\r{{\u003c card link=\"/\" title=\"Local Image\" image=\"/images/card-image-unprocessed.jpg\" subtitle=\"Raw image under static directory.\" \u003e}}\r{{\u003c card link=\"/\" title=\"Local Image\" image=\"images/space.jpg\" subtitle=\"Image under assets directory, processed by Hugo.\" method=\"Resize\" options=\"600x q80 webp\" \u003e}}\r{{\u003c /cards \u003e}}\rParámetros de la tarjeta\rParameter Description link URL (interna o externa) title título de la tarjeta subtitle Título del subtítulo (admite Markdown) icon El nombre del icono. Image Card\rAdemás, la tarjeta admite la adición de imágenes y el procesamiento mediante los siguientes parámetros:\nParameter Description image Especifica la URL de la imagen de la tarjeta. method Establezca el método de procesamiento de imágenes de Hugo. options Configure las opciones de procesamiento de imágenes de Hugo. Las tarjetas admiten tres imágenes:\nImagen remota: la URL completa debe colocarse en el parámetro de image. Imágenes estáticas: use rutas relativas en el directorio static/ de Hugo Imágenes procesadas: use rutas relativas en el directorio de assets/de Hugo Hextra detecta automáticamente durante el proceso de construcción si la imagen necesita procesamiento y aplica el parámetro de opciones o la configuración predeterminada (escala, 800x, calidad 80, formato WebP) según sea necesario.\nActualmente admite los siguientes métodos de procesamiento: Cambiar tamaño, Ajustar, Rellenar y Recortar.\nPara obtener más información sobre los comandos, métodos y opciones de procesamiento de imágenes integrados de Hugo, consulte su [Image Processing Documentation] (https://gohugo.io/content-management/image-processing/).","parámetros-de-la-tarjeta#Parámetros de la tarjeta":"","usar#usar":""},"title":"tarjeta"},"/es/about/docs/shortcodes/details/":{"data":{"":"","ejemplo#Ejemplo":"","usage#Usage":"Componente incorporado para mostrar contenido plegable.\nEjemplo\rDetails\rEste es el contenido de los detalles.\nMarkdown is supported.\nClick me to reveal\rEsto estará oculto por defecto.\rUsage\r{{% details title=\"Details\" %}} 这是细节的内容 **Soporte** Markdown {{% /details %}}\r{{% details title=\"Click me to reveal\" closed=\"true\" %}} Esto estará oculto por defecto. {{% /details %}}"},"title":"Detalles"},"/es/about/docs/shortcodes/filetree/":{"data":{"":"","ejemplo#Ejemplo":"","uso#uso":"Ejemplo\rcontent\r_index.md\rdocs\r_index.md\rintroduction.md\rintroduction.fr.md\rhugo.toml\ruso\rMarkdown{{\u003c filetree/container \u003e}} {{\u003c filetree/folder name=\"content\" \u003e}} {{\u003c filetree/file name=\"_index.md\" \u003e}} {{\u003c filetree/folder name=\"docs\" state=\"closed\" \u003e}} {{\u003c filetree/file name=\"_index.md\" \u003e}} {{\u003c filetree/file name=\"introduction.md\" \u003e}} {{\u003c filetree/file name=\"introduction.fr.md\" \u003e}} {{\u003c /filetree/folder \u003e}} {{\u003c /filetree/folder \u003e}} {{\u003c filetree/file name=\"hugo.toml\" \u003e}} {{\u003c /filetree/container \u003e}}"},"title":"árbol de archivos"},"/es/about/docs/shortcodes/icon/":{"data":{"":"","ejemplo#Ejemplo":"","uso#uso":"Para usar este código corto en línea, los códigos cortos en línea deben estar habilitados en la configuración:\nhugo.yamlenableInlineShortcodes: true\rPuede encontrar una lista de íconos disponibles en data/icons.yaml\nEjemplo\ruso\r{{\u003c icon \"github\" \u003e}}\rHeroicons iconos de esquema v1 listos para usar\nCómo agregar tu propio ícono\rCree un archivo data/icons.yaml y agregue sus propios íconos SVG en el siguiente formato:\ndata/icons.yamlyour-icon: \u003csvg\u003eyour icon svg content\u003c/svg\u003e\rLuego, esto se puede usar en un código corto como este:\n{{\u003c icon \"your-icon\" \u003e}}\r{{\u003c card icon=\"your-icon\" \u003e}}\rConsejo: Iconify Design es un excelente lugar para encontrar íconos SVG para su sitio web"},"title":"icono"},"/es/about/docs/shortcodes/steps/":{"data":{"":"","ejemplo#Ejemplo":"","usar#usar":"Un componente incorporado para mostrar una serie de pasos.\nEjemplo\rprimer paso\rEste es el primer paso.\nPaso 2\rEste es el segundo paso.\nPaso 3\rEste es el tercer paso.\nusar\rColoque el encabezado Markdown h3 en el código abreviado de steps.\n{{% steps %}}\r### Step 1\rThis is the first step.\r### Step 2\rThis is the second step.\r{{% /steps %}}"},"title":"paso"},"/es/about/docs/shortcodes/tabs/":{"data":{"":"","ejemplo#Ejemplo":"","usar#usar":"Ejemplo\rJSONYAMLTOML\rJSON: JavaScript Object Notation (JSON) is a standard text-based format for representing structured data based on JavaScript object syntax.\rYAML: YAML is a human-readable data serialization language.\rTOML: TOML aims to be a minimal configuration file format that’s easy to read due to obvious semantics.\rusar\rPor defecto\r{{\u003c tabs items=\"JSON,YAML,TOML\" \u003e}}\r{{\u003c tab \u003e}}**JSON**: JavaScript Object Notation (JSON) is a standard text-based format for representing structured data based on JavaScript object syntax.{{\u003c /tab \u003e}}\r{{\u003c tab \u003e}}**YAML**: YAML is a human-readable data serialization language.{{\u003c /tab \u003e}}\r{{\u003c tab \u003e}}**TOML**: TOML aims to be a minimal configuration file format that's easy to read due to obvious semantics.{{\u003c /tab \u003e}}\r{{\u003c /tabs \u003e}}\r###Especificar índice\nUtilice la propiedad defaultIndex para especificar la pestaña seleccionada. El índice comienza desde 0.\n{{\u003c tabs items=\"JSON,YAML,TOML\" defaultIndex=\"1\" \u003e}}\r{{\u003c tab \u003e}}**JSON**: JavaScript Object Notation (JSON) is a standard text-based format for representing structured data based on JavaScript object syntax.{{\u003c /tab \u003e}}\r{{\u003c tab \u003e}}**YAML**: YAML is a human-readable data serialization language.{{\u003c /tab \u003e}}\r{{\u003c tab \u003e}}**TOML**: TOML aims to be a minimal configuration file format that's easy to read due to obvious semantics.{{\u003c /tab \u003e}}\r{{\u003c /tabs \u003e}}\rEl valor predeterminado es YAML\nJSONYAMLTOML\rJSON: JavaScript Object Notation (JSON) is a standard text-based format for representing structured data based on JavaScript object syntax.\rYAML: YAML is a human-readable data serialization language.\rTOML: TOML aims to be a minimal configuration file format that’s easy to read due to obvious semantics.\rUsando Markdown\rTambién se admite la sintaxis de Markdown, incluidos los bloques de código:\n{{\u003c tabs items=\"JSON,YAML,TOML\" \u003e}}\r{{\u003c tab \u003e}}\r```json\r{ \"hello\": \"world\" }\r```\r{{\u003c /tab \u003e}}\r... add other tabs similarly\r{{\u003c /tabs \u003e}}\rJSONYAMLTOML\r{ \"hello\": \"world\" }\rhello: world\rhello = \"world\""},"title":"página de pestaña"},"/es/about/docs/syntax-highlighting/":{"data":{"":"","características#Características":"","lenguajes-de-programación-compatibles#Lenguajes de programación compatibles":"Qiandu usa Chroma, un renderizador de resaltado de código implementado en Golang puro. Se recomienda utilizar comillas invertidas para bloques de código en el contenido de Markdown, por ejemplo:\nMarkdown```python def say_hello(): print(\"Hello!\") ```\rse representará como:\ndef say_hello(): print(\"Hello!\")\rCaracterísticas\rNombre del archivo\rPara agregar un nombre de archivo o título a un bloque de código, configure filename:\nMarkdown```python {filename=\"hello.py\"} def say_hello(): print(\"Hello!\") ```\rhello.pydef say_hello(): print(\"Hello!\")\rNúmero de línea\rPara establecer el número de línea, establezca linenos en table y linenostart en el número de línea inicial:\nMarkdown```python {linenos=table,linenostart=42} def say_hello(): print(\"Hello!\") ```\r42 43 def say_hello(): print(\"Hello!\") Resaltar filas\rPara mostrar líneas resaltadas, establezca hl_lines en el número de línea:\nMarkdown```python {linenos=table,hl_lines=[2,4],linenostart=1,filename=\"hello.py\"} def say_hello(): print(\"Hello!\") def main(): say_hello() ```\rhello.py 1 2 3 4 5 def say_hello(): print(\"Hello!\") def main(): say_hello() Botón Copiar\rDe forma predeterminada, el botón de copia del bloque de código se habilita automáticamente.\nLenguajes de programación compatibles\rPara obtener información sobre los lenguajes de programación compatibles, vaya a la documentación de Chroma."},"title":"resaltado de código"},"/es/about/privacy/":{"data":{"":"","#":"1. Introducción\rEstamos comprometidos a proteger su privacidad y este Acuerdo de privacidad está diseñado para explicar cómo recopilamos, usamos, divulgamos y protegemos la información personal que usted proporciona cuando utiliza QianDu.\n2. Recopilación de información\rNo recopilaremos ni podemos recopilar su nombre, dirección de correo electrónico, dirección IP y otra información importante. Además, como mantenedores de la comunidad, los miembros de la comunidad también tienen las obligaciones y responsabilidades correspondientes de no revelar su cuenta de Github.\n3. Divulgación de información\rNo revelaremos su información personal a ningún tercero sin circunstancias especiales, porque la intención original de QianDu era crear una comunidad de intercambio de tecnología de privacidad.\n4. Seguridad de la información\rComo sabes, QianDu se ejecuta localmente como Pages, por lo que no recopilamos ninguna información.\n5. Contacto con la seguridad\rSi se comunica con Telegram de QianDu cuando necesita servicios relacionados con QianDu, no divulgaremos su cuenta de Telegram, pero vaya a Telegram para leer el acuerdo de privacidad relacionado con Telegram.\nResumen: este acuerdo de privacidad aclara las regulaciones de QianDu sobre la recopilación, uso, divulgación y protección de la información personal de los usuarios y protege los derechos de privacidad de los usuarios."},"title":"Acuerdo de privacidad"},"/es/blog/":{"data":{"":"\rRSS Feed\rblog\rPiensa lo que quieras, empuja lo que quieras ver"},"title":"blog"},"/es/security/":{"data":{"":"\rServicios de consultoría en ciberseguridad\rDependiendo de las necesidades de su negocio, Qiandu puede proporcionar servicios de consultoría de seguridad individuales o un paquete completo de servicios de consultoría de seguridad de red.\rConsúltanos\rPruebas de penetración\rvUn equipo de seguridad profesional con más de 10 años de experiencia práctica en penetración lo ayudará personalmente a diagnosticar las vulnerabilidades del sistema. Simule completamente el comportamiento de los piratas informáticos, realice pruebas de penetración en profundidad de los sitios web de los clientes, descubra y proporcione sugerencias de reparación para formar un informe profesional y ayude a los clientes a resolver realmente los problemas de seguridad.\nTrazabilidad\rBasándose en las pistas proporcionadas por los clientes, rastree el origen de los comportamientos maliciosos de la red (informes falsos, calumnias maliciosas, fugas de información, ataques de piratas informáticos, etc.) que han ocurrido o están ocurriendo contra las redes y sistemas de TI de los clientes.\nrespuesta de emergencia\rBasándonos en los muchos años de experiencia práctica en gestión y capacidades técnicas de defensa y ataques de seguridad de Qiandu, y haciendo referencia a los estándares internacionales relevantes de respuesta a incidentes de seguridad de la información, ayudamos a los usuarios a seguir los procesos de prevención, recopilación de información de inteligencia, contención, erradicación y recuperación para brindar servicios profesionales de 7- servicios de paso después de que ocurren incidentes de seguridad *24 servicio de procesamiento de respuesta de emergencia remota.\nconsultor de seguridad\rActuamos como su consultor de seguridad, respondiendo preguntas de seguridad, evaluando riesgos de seguridad y tomando decisiones de seguridad. Asistir en el establecimiento de normas internas de seguridad, capacitación de concientización sobre seguridad de los empleados y capacitación especial en seguridad para el personal técnico.\nconstrucción segura\rEl miedo a ser pirateado, el miedo a ser arrastrado y el miedo a ser secuestrado son las fuerzas impulsoras más directas para la construcción de seguridad. Qiandu lo ayuda a construir gradualmente un sistema de seguridad desde cero, reduciendo efectivamente la ocurrencia de incidentes de seguridad y garantizando efectivamente la seguridad básica y la seguridad empresarial.\nDesarrollo de estrategia de seguridad.\rAnalizar los objetivos comerciales, la estructura organizacional y el entorno tecnológico para desarrollar una estrategia práctica de ciberseguridad. Proporcione una hoja de ruta clara para garantizar la mejora continua en la ciberseguridad de su organización.\nDiseño de arquitectura de seguridad empresarial.\rSobre la base de las estrategias de seguridad y las necesidades comerciales del gobierno y las empresas, diseñe una arquitectura de seguridad empresarial integral, incluida la arquitectura comercial de seguridad, la arquitectura de tecnología de seguridad, la arquitectura de aplicaciones de seguridad y otros aspectos para garantizar que se satisfagan las necesidades.\nPlanificación de ingeniería de seguridad.\rBasándonos en la arquitectura de seguridad empresarial, planificamos proyectos de ingeniería de seguridad específicos para lograr los objetivos de seguridad de red de clientes gubernamentales y empresariales. y determinar las prioridades del proyecto, asignar recursos y desarrollar planes de implementación."},"title":"Consultor de Seguridad Cibernética"},"/es/service/":{"data":{"":"\rCooperar con Qiandu, Descubre infinitas posibilidades\rLa principal prioridad de Qiandu es la privacidad y seguridad del cliente. Prometemos nunca revelar información del cliente y nuestro objetivo es brindarle soluciones personalizadas, que van desde desarrollo de sitios web, seguridad de red, marketing comercial, blockchain, pagos y garantías, y otros campos para satisfacer sus necesidades específicas. necesidades\rservicio de cadena de bloques web3\rQianDu ofrece consultoría, desarrollo y otros servicios para cadenas industriales como blockchain, NFT, Yuanverse, criptomonedas, intercambios/billeteras descentralizadas, etc.\nConsultor de Seguridad Cibernética\rQiandu cuenta con un equipo de seguridad muy profesional, que puede brindar servicios de consultoría de seguridad individuales o servicios de consultoría de seguridad de red llave en mano según las necesidades de su negocio.\nWeb y aplicaciones\rQianDu brinda servicios profesionales de personalización de aplicaciones y redes. Solo necesita proporcionar los documentos de demanda y su presupuesto, y evaluaremos el período de construcción y la ejecutabilidad dentro de las 24 horas.\ntransacción segura\rQiandu es una empresa de garantía de resultados finales, ya sea que sea un proveedor de servicios o un cliente, nuestros profesionales siempre lo ayudarán a cumplir con la privacidad de su garantía. Solo brindamos servicios de garantía.\nconsultor de marketing empresarial\rQianDu le ofrece soluciones de marketing de plataforma completa para Google, FaceBook, X, Instagram, TikTok, Youtube, etc.\nComercio de software listo para usar\rQianDu depende de clientes comerciales y de código cerrado de cientos de desarrolladores para entregar productos. Podemos proporcionar transacciones para casi todo el software comercial que necesita.\nServicio 24 horas para ti\rNo importa el problema que encuentre, QianDu puede ayudarlo a resolverlo.\nContáctenos"},"title":"Atender"},"/es/web3/":{"data":{"":"","#":"\rExplora las infinitas posibilidades de la cadena de bloques Web3\rImplementar el negocio blockchain web3. Liderando la nueva tendencia de la economía digital en el futuro\rConsúltanos\rEmisión de tokens\rProporcionar servicios de acompañamiento de proceso completo, como emisión de tokens, desarrollo de sitios web oficiales de tokens, desarrollo de cambio de moneda virtual descentralizado, desarrollo de billetera de moneda virtual y listado de tokens.\nNTF\rProporcione servicios de acompañamiento de proceso completo, como emisión de NTF, desarrollo del sitio web oficial de NTF, recibos de intercambio de NTF, gestión de billeteras de NTF y listado de NTF. .\nmetaverso\rDesarrollo de proyectos en el metaverso, VR, AR/MR y otros campos.\nLa tecnología blockchain Web3 está remodelando el mundo. Nuestro estudio se compromete a brindarle una gama completa de servicios profesionales, que cubren cadenas industriales como blockchain, NFT, Metaverse, criptomonedas, intercambios/billeteras descentralizadas, etc.\rAtender\rContamos con un equipo experimentado de expertos que llevan a cabo investigaciones y prácticas en profundidad en estas áreas de vanguardia. Ya sea que necesite asesoramiento sobre la tecnología blockchain, espere desarrollar proyectos NFT innovadores, crear una experiencia de metaverso inmersivo o incluso crear intercambios y billeteras descentralizados seguros y confiables, podemos ayudarlo a brindar soluciones precisas, eficientes y profesionales.\nProceso de cooperación\rComunicación de requisitos: usted realiza el contacto inicial con nuestro equipo para detallar sus necesidades y expectativas en términos de blockchain, NFT, Metaverse, intercambios/billeteras descentralizadas, etc.\nPersonalización de soluciones: según sus necesidades, llevamos a cabo investigaciones de mercado y análisis técnicos en profundidad para personalizar soluciones exclusivas para usted.\nFirma del acuerdo: después de que ambas partes llegan a un acuerdo sobre el plan, firman un acuerdo de cooperación que vincula el contenido de la cooperación de ambas partes y aclara los derechos y obligaciones de ambas partes.\nPago del capital inicial: Pagar un capital inicial de no menos del 50% del monto total del proyecto a QianDu.\nLanzamiento del proyecto: forme un equipo de proyecto profesional, desarrolle un plan y un cronograma detallados del proyecto y lance oficialmente el proyecto.\nComunicación regular: durante el proyecto, mantenemos una comunicación regular, le informamos el progreso del proyecto de manera oportuna y escuchamos sus opiniones y sugerencias.\nEntrega de resultados: Entregarle los resultados del proyecto de acuerdo con el tiempo y los estándares acordados en el contrato, y brindarle soporte técnico y capacitación relevantes.\nPagar el saldo: pagar el monto restante de la cooperación del proyecto.\nServicio posventa: una vez entregado el proyecto, brindamos un servicio posventa continuo para garantizar el funcionamiento estable y la optimización y actualización del proyecto."},"title":"servicio de cadena de bloques web3"}}