{"/pt/about/":{"data":{"":"","como-usar-o-qiandu#Como usar o QianDu":"Desincorporado não significa restrito.\nNa verdade, esta é a nossa superpotência. A nossa pequena dimensão - segura e capaz de fornecer serviços 1V1/0V1 - permite-nos avançar de forma mais rápida e ágil, e temos parceiros de todo o mundo a trabalhar remotamente para lhe fornecer tudo o que necessita.\nAo utilizar o QianDu, não está apenas a utilizar uma plataforma;","compromisso-de-qiandu#Compromisso de QianDu":"Estamos profundamente conectados com os nossos utilizadores.\nCada e-mail, pergunta ou feedback que envia é lido e respondido por uma pessoa real – não um bot, não uma equipa de suporte de terceiros, mas um ser humano no coração do QianDU.\nEstamos empenhados em prestar um serviço que resolva os seus problemas e proporcione uma experiência perfeita e fiável.","história-de-qiandu#História de QianDu":"O antecessor do Qiandu foi um fórum chinês bem conhecido.\nFundada, a QianDu é uma comunidade de desenvolvimento que atribui grande importância à privacidade na Internet e é operada com o apoio e a experiência de muitos parceiros em todo o mundo.\nDurante anos, temos o compromisso de fornecer soluções fiáveis ​​e fiáveis ​​da forma mais privada, para que possamos realmente fazer a diferença para os nossos utilizadores.\nComo equipa remota e autossuficiente, não estamos sujeitos a quaisquer políticas ou requisitos dos investidores. Esta liberdade permite-nos ser flexíveis para mudar e focarmo-nos no que realmente importa: os nossos utilizadores.\nA equipa fundadora começou no setor dos serviços de privacidade em 2008, sem capital de risco ou financiamento externo. Cada serviço que desenvolvemos e cada decisão que tomamos é cuidadosamente ponderada e centrada no utilizador. O percurso ao longo dos anos nem sempre foi fácil, mas foi muito gratificante.\nTomamos decisões com base no que é melhor para as suas necessidades e não no que é melhor para o conselho.\nAndy Musk: Espero que os nossos utilizadores possam ter verdadeira liberdade e tudo o que temos de fazer é ajudá-los (as palavras de A na reunião com toda a equipa representam verdadeiramente os pensamentos de todos nós)","método-de-pagamento-qiandu#Método de pagamento QianDu":"A QianDu apenas suporta a utilização de BTC e USDT para pagar os serviços prestados pela QianDu, e alteraremos o endereço de pagamento após um período de tempo. Consulte o endereço da carteira publicado aqui:\nBTC: bc1plklsdytnfk2elhd00gg5r08e3cdye6j96cr4etpnd0crgpnuzr6s69hgqj\nUSDT(ERC20): 0xE40E0dc445BA8D6C7db0318cC48D34556457FE13\nUSDT(TRC20): TUXiSG7EVk1rrc9pQzCLe6W1P3btvnB7Dm","o-que-é-o-qiandu#O que é o QianDu":"Qiandu é uma comunidade que protege a privacidade do utilizador a 100%.\nA comunidade promete que qualquer promotor que possa entrar na comunidade deve ser um profissional do setor que tenha pago um depósito ou tenha uma vasta experiência.","valores-de-qiandu#Valores de QianDu":" Fiabilidade: Com anos de experiência no setor, compreendemos a natureza crítica do nosso trabalho. A maioria dos membros da nossa equipa remota inclui os principais talentos de Silicon Valley, Nova Deli, Índia, e Zhongguancun, Pequim. 2.º Transparência: Acreditamos na comunicação aberta. QianDu permite-nos ser honestos sobre as nossas capacidades e limitações e esforçamo-nos sempre para superar as suas expectativas. Responsabilidade: Ser gerido principalmente pela QianDu significa que somos responsáveis ​​por todos os aspetos dos serviços dos membros da nossa equipa. Apoiamos o nosso trabalho e assumimos a responsabilidade pelos nossos sucessos e erros. Inovação: Estamos sempre à procura de formas de melhorar e inovar. A nossa estrutura ágil permite-nos implementar rapidamente novas ideias e responder às necessidades dos utilizadores. 5.º Estilo pessoal: Acreditamos no poder das relações. Ao trabalhar com a QianDu, é mais do que apenas um cliente – interage diretamente com as pessoas que estão por detrás do produto. Obrigado por escolher QianDu e apoiar a comunidade de desenvolvimento independente.\nHá dezasseis anos que crescemos e nos desenvolvemos e esperamos continuar esta viagem consigo, melhorando constantemente os nossos serviços e tornando-nos o seu parceiro de confiança na área da Internet."},"title":"Sobre o Qiandu"},"/pt/about/contact/":{"data":{"":"Olá ~ Estou feliz por conhecê-lo no QianDu e espero que se junte ao QianDu em breve!\nContacte-nos ","o-que-posso-fazer-ao-aderir-ao-qiandu#O que posso fazer ao aderir ao QianDu?":"Pode prestar serviços aos visitantes do QianDu:\nRede e aplicações Consultor de segurança de rede Serviço de pagamento Transação Garantida Consultor de Marketing Empresarial Serviço Blockchain Web3 Comércio de software Também pode participar na manutenção de conteúdo do QianDu\nBlog Navegação por ferramenta de comércio internacional Navegação na ferramenta Blockchain Navegação por ferramenta de IA Navegação na ferramenta ","posso-aderir-ao-qiandu#Posso aderir ao QianDu?":"É claro que convidámos os programadores/bloggers preocupados com a privacidade de todo o mundo para se juntarem a nós."},"title":"Junte-se à comunidade"},"/pt/about/docs/":{"data":{"":"Explore as secções seguintes para saber como participar na manutenção da comunidade Qiandu:\nEstrutura de diretório Configuração Markdown destaque de código Fórmula LaTeX gráfico código curto "},"title":"Guia de manutenção comunitária"},"/pt/about/docs/configuration/":{"data":{"":"O Qiandu lê a configuração de hugo.yaml no directório raiz do site Hugo. No ficheiro de configuração pode configurar todas as opções do seu site. Pode encontrar o ficheiro de configuração deste site em exampleSite/hugo.yaml para começar.","barra-de-navegação#Barra de navegação":"menu O menu no canto superior direito está configurado em menu. main do ficheiro de configuração:\nhugo.yamlmenu: main: - name: Documentation pageRef: /docs weight: 1 - name: Blog pageRef: /blog weight: 2 - name: About pageRef: /about weight: 3 - name: Search weight: 4 params: type: search - name: GitHub weight: 5 url: \"\" params: icon: github Existem vários tipos diferentes de itens de menu:\nLink to a page in the site with pageRef - name: Documentation pageRef: /docs Link to an external URL with url - name: GitHub url: \"https://github.com\" Search bar with type: search - name: Search params: type: search Icon - name: GitHub params: icon: github Estes itens de menu podem ser classificados definindo weight.","barra-lateral#Barra lateral":"Barra lateral principal A barra lateral principal é gerada automaticamente a partir da estrutura de directórios content. Para mais detalhes, aceda a Estrutura de diretórios.\nLinks adicionais Links adicionais para a barra lateral são configurados na secção menu.sidebar do ficheiro de configuração:\nhugo.yamlmenu: sidebar: - name: More params: type: separator weight: 1 - name: \"About\" pageRef: \"/about\" weight: 2 - name: \"Docs ↗\" url: \"https://gohugo.io/name/\" weight: 3 ","barra-lateral-direita#Barra lateral direita":"Índice O índice é gerado automaticamente com base nos títulos do ficheiro de conteúdo, isto pode ser desativado configurando toc:false em front matter.\ncontent/docs/guide/configuration.md--- title: Configuration toc: false --- Edite o link desta página Para configurar o link de edição desta página, podemos definir params.editURL.base no ficheiro de configuração:\nhugo.yamlparams: editURL: base: \"https://github.com/your-username/your-repo/edit/main\" Os links de edição serão gerados automaticamente para cada página. Para definir um link de edição para uma página específica, pode definir editURL no front matter da página:\ncontent/docs/guide/configuration.md--- title: Configuration editURL: \"https://example.com/edit/this/page\" --- ","footer#Footer":"Declaração de direitos de autor Para modificar o texto de copyright que aparece no rodapé do seu site, terá de criar um ficheiro chamado “i18n/en.yaml”. Neste ficheiro, preencha o novo texto de copyright, assim:\ni18n/en.yamlcopyright: \"© 2024 Qiandu.org\" Pode encontrar o ficheiro de exemplo i18n/en.yaml no repositório GitHub. Além disso, pode utilizar a formatação Markdown em texto protegido por direitos de autor.","outro#outro":"Favicon Se precisar de personalizar o favicon, coloque o ficheiro do ícone na pasta static para substituir o [favicon padrão no tema](https://github. com/imfing/hextra/tree/main/static):\nstatic android-chrome-192x192.png android-chrome-512x512.png apple-touch-icon.png favicon-16x16.png favicon-32x32.png favicon-dark.svg favicon.ico favicon.svg site.webmanifest Inclua os ficheiros favicon.ico e favicon.svg no seu projeto para garantir que o favicon do site é apresentado corretamente.\nEmbora o favicon.ico funcione geralmente em navegadores mais antigos, o favicon.svg é compatível com os navegadores modernos, pelo que uma abordagem mais moderna seria adicionar o favicon-dark.svg para servir melhor no modo escuro.\nSinta-se à vontade para utilizar ferramentas como favicon.io ou favycon para gerar estes ícones.\nConfiguração do tema de cores Utilize a definição theme para configurar o modo de tema padrão e o botão de alternância que permite aos visitantes alternar entre o modo claro ou escuro.\nhugo.yamlparams: theme: # light | dark | system default: system displayToggle: true Opções para theme.default:\nlight - utilizar apenas o modo light dark - utilize apenas o modo look system - siga o sistema theme.displayToggle controla a apresentação dos botões de alternância para alterar os temas. Quando definido como “true”, os visitantes podem alternar entre o modo claro ou escuro, substituindo a definição padrão.\nLargura da página A largura da página pode ser ajustada através do parâmetro params.page.width no ficheiro de configuração:\nhugo.yamlparams: page: # full (100%), wide (90rem), normal (1280px) width: wide Existem três opções: full, wide e normal.\nDa mesma forma, a largura da barra de navegação e do footer também pode ser ajustada através de params.navbar.width e params.footer.width.\nprocurar A pesquisa de texto integral fornecida pelo FlexSearch está ativada por defeito. Para personalizar o índice de pesquisa, defina params.search.flexsearch.index no ficheiro de configuração:\nhugo.yamlparams: # Search search: enable: true type: flexsearch flexsearch: # index page by: content | summary | heading | title index: content Opções para flexsearch.index:\ncontent - pesquisa de conteúdo completo summary - Overview Hugo Content Summary heading - títulos de primeiro e segundo nível title - pesquisa apenas pelo título Para personalizar a tokenização de pesquisa, defina params.search.flexsearch.tokenize no ficheiro de configuração:\nparams: # ... flexsearch: # full | forward | reverse | strict tokenize: forward Opções flexsearch.tokenize:\nstrict - correspondência estrita de palavras forward - correspondência de prefixo de palavra reverse - correspondência do prefixo e sufixo da palavra full - correspondência de substring de palavras. Na lógica de segmentação de palavras padrão, uma frase em chinês é uma “palavra”\nPara eliminar uma página do índice de pesquisa, altere excludeSearch: true no início:\ncontent/docs/guide/configuration.md--- title: Configuration excludeSearch: true --- Google Analytics Para ativar o Google Analytics, defina services.googleAnalytics.ID:\nhugo.yamlservices: googleAnalytics: ID: G-MEASUREMENT_ID "},"title":"ficheiro de configuração"},"/pt/about/docs/deploy-site/":{"data":{"":"O Qiandu gera sites estáticos localmente e implementou vários métodos de alojamento para sincronizar e suportar o acesso do utilizador.","cloudflare#Cloudflare":"Nó mestre Cloudflaredev.qiandu.org\nNó de cópia de segurança Cloudflare: qiandu.pages.dev","github-pages#GitHub Pages":"GitHub Master nodeqiandu.org\nNó de cópia de segurança do GitHub: qianduorg.github.io","netlify#Netlify":"Entrada aberta temporariamente","vercel#Vercel":"Entrada aberta temporariamente"},"title":"Visite qiandu.org"},"/pt/about/docs/diagrams/":{"data":{"":"Atualmente, o Qiandu suporta o gráfico de Mermaid.","mermaid#Mermaid":"Mermaid é uma ferramenta de desenho de gráficos baseada em JavaScript. Por exemplo: fluxograma, diagrama de sequência, gráfico de pizza, etc.\nUsar o Mermaid no Hextra é tão fácil como usar blocos de código:\n```mermaid graph TD; A--\u003eB; A--\u003eC; B--\u003eD; C--\u003eD; ``` será renderizado como:\ngraph TD; A--\u003eB; A--\u003eC; B--\u003eD; C--\u003eD;Sequence diagram：\nsequenceDiagram participant Alice participant Bob Alice-\u003e\u003eJohn: Hello John, how are you? loop Healthcheck John-\u003e\u003eJohn: Fight against hypochondria end Note right of John: Rational thoughts prevail! John--\u003e\u003eAlice: Great! John-\u003e\u003eBob: How about you? Bob--\u003e\u003eJohn: Jolly good!Para mais informações, aceda a Mermaid Documentation."},"title":"gráfico"},"/pt/about/docs/latex/":{"data":{"":"$\\KaTeX$ é utilizado para renderizar expressões matemáticas LaTeX. Pode ser activado configurando math como true em frontmatter.\nMarkdown--- title: \"My Page with LaTeX\" math: true --- Quando ativado, os scripts, folhas de estilo e tipos de letra do KaTeX serão automaticamente incluídos no seu website. Isto permite-lhe utilizar expressões matemáticas LaTeX no conteúdo Markdown.","exemplo#Exemplo":"O conteúdo Markdown suporta expressões matemáticas LaTeX tanto inline como em parágrafos independentes.\nEm linha page.mdThis $\\sigma(z) = \\frac{1}{1 + e^{-z}}$ is inline. This $\\sigma(z) = \\frac{1}{1 + e^{-z}}$ is inline.\nParágrafo independente page.md$$F(\\omega) = \\int_{-\\infty}^{\\infty} f(t) e^{-j\\omega t} \\, dt$$ será renderizado como:\n$$F(\\omega) = \\int_{-\\infty}^{\\infty} f(t) e^{-j\\omega t} , dt$$","expressão-química#Expressão química":"As expressões químicas são suportadas através de mhchem.\nEm linha: $\\ce{H2O}$ é água.\nParágrafo independente:\npage.md$$\\ce{Hg^2+ -\u003e[I-] HgI2 -\u003e[I-] [Hg^{II}I4]^2-}$$ $$\\ce{Hg^2+ -\u003e[I-] HgI2 -\u003e[I-] [Hg^{II}I4]^2-}$$","funções-suportadas#Funções suportadas":"Para obter uma lista de símbolos suportados, aceda a Fórmulas suportadas pelo KaTeX."},"title":"Fórmula LaTeX"},"/pt/about/docs/markdown/":{"data":{"":"O Qiandu suporta Markdown para escrever conteúdo, criar listas, etc. Esta página irá mostrar alguns dos exemplos de sintaxe Markdown mais comuns utilizados pelo Qiandu.","noções-básicas-de-redução#Noções básicas de redução":"Estilo de texto Style Syntax Example Output Bold **bold text** **bold text** bold text Italic *italicized text* `italicized text italicized text Strikethrough ~~strikethrough text~~ ~~strikethrough text~~ strikethrough text Subscript \u003csub\u003e\u003c/sub\u003e This is a \u003csub\u003esubscript\u003c/sub\u003e text This is a subscript text Superscript \u003csup\u003e\u003c/sup\u003e This is a \u003csup\u003esuperscript\u003c/sup\u003e text This is a superscript text Citar Citações em bloco com subscritos:\nDon’t communicate by sharing memory, share memory by communicating.\n— Rob Pike1\nMarkdown\u003e Don't communicate by sharing memory, share memory by communicating.\u003cbr\u003e \u003e — \u003ccite\u003eRob Pike[^1]\u003c/cite\u003e [^1]: The above quote is excerpted from Rob Pike's [talk](https://www.youtube.com/watch?v=PAAkCSZUG1c) during Gopherfest, November 18, 2015. folha As tabelas não são uma especificação básica do Markdown, mas o Hugo suporta tabelas prontas a usar:\nName Age Bob 27 Alice 23 Markdown| Name | Age | |--------|------| | Bob | 27 | | Alice | 23 | Inline na tabela Markdown Italics Bold Code italics bold code Markdown| Italics | Bold | Code | | -------- | -------- | ------ | | *italics* | **bold** | `code` | Bloco de código Syntax Highlighting Lista Lista ordenada First item Second item Third item Markdown1. First item 2. Second item 3. Third item Lista não ordenada List item Another item And another item Markdown* List item * Another item * And another item Lista aninhada Fruit Apple Orange Banana Dairy Milk Cheese Markdown* Fruit * Apple * Orange * Banana * Dairy * Milk * Cheese foto Markdown![landscape](https://picsum.photos/800/600) Com título:\nUnsplash Landscape Markdown![landscape](https://picsum.photos/800/600 \"Unsplash Landscape\") O Qiandu utiliza o Goldmark para analisar o Markdown. A renderização de Markdown pode ser configurada contactando o administrador da comunidade em markup.goldmark em hugo.yaml. A seguir é apresentada a configuração padrão do Qiandu:\nhugo.yamlmarkup: goldmark: renderer: unsafe: true highlight: noClasses: false Para mais opções, aceda aConfigure Markup。\nThe above quote is excerpted from Rob Pike’s talk during Gopherfest, November 18, 2015. ↩︎","referências-md#Referências MD":" Markdown Guide Markdown Cheatsheet Markdown Tutorial Markdown Reference "},"title":"Sintaxe Markdown"},"/pt/about/docs/multi-language/":{"data":{"":"O Qiandu suporta a utilização do modo multilingue do Hugo para criar sites multilingues.","ativar-suporte-multilingue#Ativar suporte multilingue":"Para que o Qiandu suporte o seu idioma, precisa de informar o Hugo quais os idiomas que precisam de ser suportados. Adicione o ficheiro de configuração do site do Qiandu:\nhugo.yamldefaultContentLanguage: en languages: en: languageName: English weight: 1 fr: languageName: Français weight: 2 ja: languageName: 日本語 weight: 3 ","gerir-traduções-por-nome-de-ficheiro#Gerir traduções por nome de ficheiro":"O Hugo suporta a gestão de traduções por nome de ficheiro. Por exemplo, se tivermos um ficheiro em inglês content/docs/_index.md, podemos criar um ficheiro traduzido para francês content/docs/_index.fr.md.\ncontent docs _index.md _index.fr.md _index.ja.md Nota: O Hugo também suporta a tradução por diretório de conteúdo (https://gohugo.io/content-management/multilingual/#translation-by-content-directory).","mais-referências#Mais referências":" Hugo Multilingual Mode Hugo Multilingual Part 1: Content translation Hugo Multilingual Part 2: Strings localization ","traduzir-itens-de-menu#Traduzir itens de menu":"Para traduzir itens de menu na barra de navegação, precisamos de definir o campo identifier:\nhugo.yamlmenu: main: - identifier: documentation name: Documentation pageRef: /docs weight: 1 - identifier: blog name: Blog pageRef: /blog weight: 2 ","traduzir-string#Traduzir string":"Para traduzir strings para outro local, precisamos de adicionar a tradução ao ficheiro i18n correspondente:\ni18n/fr.yamlreadMore: Lire la suite "},"title":"Multilingue"},"/pt/about/docs/organize-files/":{"data":{"":"","configurar-diretório-de-conteúdo#Configurar diretório de conteúdo":"Se precisar de utilizar um diretório diferente para o conteúdo, pode contactar o administrador para definir contentDir no ficheiro de configuração do site para conseguir isso.","introdução-ao-diretório#Introdução ao diretório":"Por defeito, o Qiandu é mantido com base no Hugo, pelo que o conteúdo é pesquisado por ficheiros Markdown no directório content. Por exemplo:\ncontent _index.md docs _index.md getting-started.md guide _index.md organize-files.md blog _index.md post-1.md Cada ficheiro _index.md é uma página de índice para a secção correspondente, e outros ficheiros Markdown são páginas normais.\ncontent ├── _index.md // \u003c- / ├── docs │ ├── _index.md // \u003c- /docs/ │ ├── getting-started.md // \u003c- /docs/getting-started/ │ └── guide │ ├── _index.md // \u003c- /docs/guide/ │ └── organize-files.md // \u003c- /docs/guide/organize-files/ └── blog ├── _index.md // \u003c- /blog/ └── post-1.md // \u003c- /blog/post-1/ ","navegação-na-barra-lateral#Navegação na barra lateral":"A navegação na barra lateral é gerada automaticamente com base na ordem alfabética em que o conteúdo é organizado. Para configurar manualmente a ordem da barra lateral, pode utilizar a definição weight no frontmatter do ficheiro Markdown.\ncontent/docs/guide/_index.md--- title: Guide weight: 2 --- ℹ️ Recomenda-se que a barra lateral não seja demasiado profunda. Se houver muito conteúdo, considere dividi-lo em várias partes. "},"title":"estrutura de diretórios"},"/pt/about/docs/shortcodes/":{"data":{"":"Códigos de acesso Hugo são simples excertos nos seus ficheiros de conteúdo que chamam modelos integrados ou personalizados.\nA Hextra oferece uma coleção de belos códigos de acesso para melhorar o seu conteúdo.\nNotas card Árvore de ficheiros icon Steps Tabs "},"title":"shortcode"},"/pt/about/docs/shortcodes/callout/":{"data":{"":"Componente integrado que exibe informações importantes aos leitores.","example#Example":" 👾 Nota é um pequeno texto criado para atrair a atenção ℹ️ Nota é um pequeno texto criado para atrair a atenção。 ⚠️ Nota é um pequeno texto criado para atrair a atenção。 🚫 Nota é um pequeno texto criado para atrair a atenção。 ","usage#Usage":"Default 🌐 O Hugo pode ser utilizado para criar uma variedade de sites, incluindo blogs, portfólios, sites de documentação e muito mais {{\u003c callout emoji=\"🌐\" \u003e}} O Hugo pode ser utilizado para criar uma variedade de sites, incluindo blogs, portfólios, sites de documentação e muito mais {{\u003c /callout \u003e}} Info ℹ️ Visite o GitHub para ver a versão mais recente {{\u003c callout type=\"info\" \u003e}} Visite o GitHub para ver a versão mais recente {{\u003c /callout \u003e}} Warning ⚠️ Esta API será obsoleta na próxima versão {{\u003c callout type=\"warning\" \u003e}} Uma **frase de destaque** é um pequeno texto criado para atrair a atenção {{\u003c /callout \u003e}} Error 🚫 Algo correu mal, vai explodir. {{\u003c callout type=\"error\" \u003e}} Algo correu mal, vai explodir. {{\u003c /callout \u003e}} "},"title":"rótulo"},"/pt/about/docs/shortcodes/cards/":{"data":{"":"","cartão-de-imagem#Cartão de imagem":"Além disso, o cartão suporta a adição de imagens e o processamento através dos seguintes parâmetros:\nParameter Description image Especifica o URL da imagem do cartão method Defina o método de processamento de imagem do Hugo. options Configurar as opções de processamento de imagem do Hugo. Os cartões suportam três imagens:\nImagem remota: O URL completo deve ser colocado no parâmetro imagem Imagens estáticas: utilize caminhos relativos no diretório static/ do Hugo Imagens processadas: utilize caminhos relativos no diretório assets/do Hugo O Hextra deteta automaticamente durante o processo de construção se a imagem necessita de processamento e aplica o parâmetro de opções ou definições padrão (escala, 800x, qualidade 80, formato WebP) conforme necessário.\nAtualmente suporta os seguintes métodos de processamento: Redimensionar, Ajustar, Preencher e Cortar.\nPara obter mais informações sobre os comandos, métodos e opções de processamento de imagem integrados do Hugo, consulte a Image Processing Documentation.","exemplo#Exemplo":" Callout Image CardQiandu Cards Local ImageQiandu Cards Local ImageQiandu Cards ","parâmetros-do-cartão#Parâmetros do cartão":" Parameter Description link URL (interno ou externo) title O título do cartão subtitle Título da legenda (suporta Markdown) icon O nome do ícone ","usar#usar":" {{\u003c/* cards */\u003e}} {{\u003c/* card link=\"../callout\" title=\"Callout\" icon=\"warning\" */\u003e}} {{\u003c/* card link=\"/\" title=\"No Icon\" */\u003e}} {{\u003c/* /cards */\u003e}} {{\u003c/* cards */\u003e}} {{\u003c/* card link=\"/\" title=\"Image Card\" image=\"https://source.unsplash.com/featured/800x600?landscape\" subtitle=\"Unsplash Landscape\" */\u003e}} {{\u003c/* card link=\"/\" title=\"Local Image\" image=\"/images/card-image-unprocessed.jpg\" subtitle=\"Raw image under static directory.\" */\u003e}} {{\u003c/* card link=\"/\" title=\"Local Image\" image=\"images/space.jpg\" subtitle=\"Image under assets directory, processed by Hugo.\" method=\"Resize\" options=\"600x q80 webp\" */\u003e}} {{\u003c/* /cards */\u003e}} "},"title":"cartão"},"/pt/about/docs/shortcodes/details/":{"data":{"":"Componente integrado para exibir conteúdo recolhível.","exemplo#Exemplo":" Details Este é o conteúdo dos detalhes\nMarkdown is supported.\nClick me to reveal Isso ficará oculto por defeito ","usage#Usage":" {{%/* details title=\"Details\" */%}} 这是细节的内容 **Apoio** Markdown {{%/* /details */%}} {{%/* details title=\"Click me to reveal\" closed=\"true\" */%}} Isso ficará oculto por defeito {{%/* /details */%}} "},"title":"detalhes"},"/pt/about/docs/shortcodes/filetree/":{"data":{"":"","exemplo#Exemplo":" content _index.md docs _index.md introduction.md introduction.fr.md hugo.toml ","uso#Uso":" Markdown{{\u003c/* filetree/container */\u003e}} {{\u003c/* filetree/folder name=\"content\" */\u003e}} {{\u003c/* filetree/file name=\"_index.md\" */\u003e}} {{\u003c/* filetree/folder name=\"docs\" state=\"closed\" */\u003e}} {{\u003c/* filetree/file name=\"_index.md\" */\u003e}} {{\u003c/* filetree/file name=\"introduction.md\" */\u003e}} {{\u003c/* filetree/file name=\"introduction.fr.md\" */\u003e}} {{\u003c/* /filetree/folder */\u003e}} {{\u003c/* /filetree/folder */\u003e}} {{\u003c/* filetree/file name=\"hugo.toml\" */\u003e}} {{\u003c/* /filetree/container */\u003e}} "},"title":"árvore de ficheiros"},"/pt/about/docs/shortcodes/icon/":{"data":{"":"Para utilizar este shortcode inline, os shortcodes inline precisam de ser ativados na configuração:\nhugo.yamlenableInlineShortcodes: true Uma lista de ícones disponíveis pode ser encontrada em data/icons.yaml","exemplo#Exemplo":" ","uso#Uso":" {{\u003c/* icon \"github\" */\u003e}} Heroicons Ícones de contorno v1 prontos a usar\nComo adicionar o seu próprio ícone Crie um ficheiro data/icons. yaml e adicione os seus próprios ícones SVG no seguinte formato:\ndata/icons.yamlyour-icon: \u003csvg\u003eyour icon svg content\u003c/svg\u003e Isto pode então ser usado num shortcode como este:\n{{\u003c/* icon \"your-icon\" */\u003e}} {{\u003c/* card icon=\"your-icon\" */\u003e}} Dica: Iconify Design é um excelente local para encontrar ícones SVG para o seu site"},"title":"ícone"},"/pt/about/docs/shortcodes/steps/":{"data":{"":"A built-in component to display a series of steps.","exemplo#Exemplo":" Primeiro passo Este é o primeiro passo.\nPasso 2 Este é o segundo passo.\nO terceiro passo Este é o terceiro passo.","usar#usar":"Coloque o cabeçalho Markdown h3 no shortcode steps.\n{{%/* steps */%}} ### Step 1 This is the first step. ### Step 2 This is the second step. {{%/* /steps */%}} "},"title":"passo"},"/pt/about/docs/shortcodes/tabs/":{"data":{"":"","exemplo#Exemplo":" JSONYAMLTOML JSON: JavaScript Object Notation (JSON) is a standard text-based format for representing structured data based on JavaScript object syntax. YAML: YAML is a human-readable data serialization language. TOML: TOML aims to be a minimal configuration file format that’s easy to read due to obvious semantics. ","usar#usar":"Por defeito {{\u003c tabs items=\"JSON,YAML,TOML\" \u003e}} {{\u003c tab \u003e}}**JSON**: JavaScript Object Notation (JSON) is a standard text-based format for representing structured data based on JavaScript object syntax.{{\u003c /tab \u003e}} {{\u003c tab \u003e}}**YAML**: YAML is a human-readable data serialization language.{{\u003c /tab \u003e}} {{\u003c tab \u003e}}**TOML**: TOML aims to be a minimal configuration file format that's easy to read due to obvious semantics.{{\u003c /tab \u003e}} {{\u003c /tabs \u003e}} Especifique o índice Utilize a propriedade defaultIndex para especificar o separador selecionado. O índice começa em 0.\n{{\u003c tabs items=\"JSON,YAML,TOML\" defaultIndex=\"1\" \u003e}} {{\u003c tab \u003e}}**JSON**: JavaScript Object Notation (JSON) is a standard text-based format for representing structured data based on JavaScript object syntax.{{\u003c /tab \u003e}} {{\u003c tab \u003e}}**YAML**: YAML is a human-readable data serialization language.{{\u003c /tab \u003e}} {{\u003c tab \u003e}}**TOML**: TOML aims to be a minimal configuration file format that's easy to read due to obvious semantics.{{\u003c /tab \u003e}} {{\u003c /tabs \u003e}} O predefinido é YAML\nJSONYAMLTOML JSON: JavaScript Object Notation (JSON) is a standard text-based format for representing structured data based on JavaScript object syntax. YAML: YAML is a human-readable data serialization language. TOML: TOML aims to be a minimal configuration file format that’s easy to read due to obvious semantics. Utilizando o Markdown A sintaxe Markdown, incluindo os blocos de código, também é suportada:\n{{\u003c tabs items=\"JSON,YAML,TOML\" \u003e}} {{\u003c tab \u003e}} ```json { \"hello\": \"world\" } ``` {{\u003c /tab \u003e}} ... add other tabs similarly {{\u003c /tabs \u003e}} JSONYAMLTOML { \"hello\": \"world\" } hello: world hello = \"world\" "},"title":"página da guia"},"/pt/about/docs/syntax-highlighting/":{"data":{"":"O Qiandu utiliza o Chroma, um renderizador de destaque de código implementado em Golang puro. Recomenda-se a utilização de crases para blocos de código no conteúdo Markdown, por exemplo:\nMarkdown```python def say_hello(): print(\"Hello!\") ``` será renderizado como:\ndef say_hello(): print(\"Hello!\") ","características#Características":"nome do ficheiro Para adicionar um nome de ficheiro ou título a um bloco de código, defina filename:\nMarkdown```python {filename=\"hello.py\"} def say_hello(): print(\"Hello!\") ``` hello.pydef say_hello(): print(\"Hello!\") Número da linha Para definir o número da linha, defina linenos como table e linenostart como o número da linha inicial:\nMarkdown```python {linenos=table,linenostart=42} def say_hello(): print(\"Hello!\") ``` 42 43 def say_hello(): print(\"Hello!\") Destacar linhas Para visualizar linhas destacadas, defina hl_lines como o número da linha:\nMarkdown```python {linenos=table,hl_lines=[2,4],linenostart=1,filename=\"hello.py\"} def say_hello(): print(\"Hello!\") def main(): say_hello() ``` hello.py 1 2 3 4 5 def say_hello(): print(\"Hello!\") def main(): say_hello() Botão Copiar Por predefinição, o botão de cópia do bloco de código é ativado automaticamente.","linguagens-de-programação-suportadas#Linguagens de programação suportadas":"Para saber mais sobre as linguagens de programação suportadas, aceda à Chroma’s documentation。"},"title":"Destaque de código"},"/pt/about/privacy/":{"data":{"":"","#":"1. Introdução Estamos empenhados em proteger a sua privacidade e este Acordo de Privacidade foi elaborado para explicar como recolhemos, utilizamos, divulgamos e protegemos as informações pessoais que fornece ao utilizar o QianDu.\n2. Recolha de informação Não iremos nem podemos recolher o seu nome, endereço de e-mail, endereço IP e outras informações importantes.\n3. Divulgação de informação Não divulgaremos as suas informações pessoais a terceiros sem quaisquer circunstâncias especiais, porque a intenção original da QianDu era criar uma comunidade de troca de tecnologia de privacidade.\n4. Segurança da Informação Como sabe, o QianDu é executado localmente como páginas, pelo que não recolhemos qualquer informação.\n5. Contacte a segurança Se contactar o Telegram do QianDu quando precisar de serviços relacionados com o QianDu, não divulgaremos a sua conta Telegram, mas aceda ao Telegram para ler o acordo de privacidade relacionado com o Telegram.\nResumo: Este acordo de privacidade esclarece os regulamentos da QianDu sobre a recolha, utilização, divulgação e proteção das informações pessoais dos utilizadores e protege os direitos de privacidade dos utilizadores."},"title":"Acordo de privacidade"},"/pt/blog/":{"data":{"":" RSS Feed blog Pense o que quiser, empurre o que quiser ver "},"title":"blog"},"/pt/security/":{"data":{"":" Serviços de consultoria em cibersegurança Dependendo das necessidades do seu negócio, a Qiandu pode fornecer serviços de consultoria de segurança individuais ou um pacote completo de serviços de consultoria de segurança de rede. Consulte-nos Teste de penetração Uma equipa de segurança profissional com mais de 10 anos de experiência prática em penetração irá ajudá-lo pessoalmente a diagnosticar vulnerabilidades do sistema. Simule completamente o comportamento dos hackers, realize testes de penetração aprofundados nos sites dos clientes, descubra e forneça sugestões de reparação para formar um relatório profissional e ajude os clientes a resolver realmente os problemas de segurança.\nRastreabilidade Com base nas pistas fornecidas pelos clientes, acompanhe a origem dos comportamentos maliciosos na rede (relatórios falsos, calúnias maliciosas, fugas de informação, ataques de hackers, etc.) que ocorreram ou estão a ocorrer contra as redes e sistemas informáticos dos clientes.\nresposta de emergência Com base nos muitos anos de capacidade técnica prática de ataque e defesa de segurança e experiência de gestão da Qiandu, e referindo-nos aos padrões internacionais relevantes de resposta a incidentes de segurança da informação, ajudamos os utilizadores a seguir os processos de prevenção, recolha de informações de inteligência, contenção, erradicação e recuperação para fornecer profissionais 7- serviços de etapa após a ocorrência de incidentes de segurança *24 serviço de processamento remoto de resposta a emergências.\nconsultor de segurança Atuamos como o seu consultor de segurança, respondendo a questões de segurança, avaliando os riscos de segurança e tomando decisões de segurança. Auxiliar no estabelecimento de regulamentos internos de segurança, formação de sensibilização para a segurança dos colaboradores e formação especial de segurança para o pessoal técnico.\nconstrução segura O medo de ser pirateado, o medo de ser arrastado e o medo de ser raptado são as forças motrizes mais diretas para a construção da segurança. O Qiandu ajuda-o a construir gradualmente um sistema de segurança a partir do zero, reduzindo eficazmente a ocorrência de incidentes de segurança e garantindo eficazmente a segurança básica e a segurança empresarial.\nDesenvolvimento de estratégia de segurança Analise os objetivos de negócio, a estrutura organizacional e o ambiente tecnológico para desenvolver uma estratégia prática de cibersegurança. Forneça um roteiro claro para garantir a melhoria contínua na cibersegurança da sua organização.\nProjeto de arquitetura de segurança empresarial Com base nas estratégias de segurança e nas necessidades comerciais do governo e das empresas, conceba uma arquitetura de segurança empresarial abrangente, incluindo a arquitetura empresarial de segurança, a arquitetura de tecnologia de segurança, a arquitetura de aplicações de segurança e outros aspetos para garantir que as necessidades sejam atendidas.\nPlaneamento de engenharia de segurança Com base na arquitetura de segurança empresarial, planeamos projetos específicos de engenharia de segurança para atingir as metas de segurança de rede de clientes governamentais e empresariais. e determinar as prioridades dos projetos, alocar recursos e desenvolver planos de implementação."},"title":"Consultor de Cibersegurança"},"/pt/service/":{"data":{"":" Coopere com a Qiandu, Descubra infinitas possibilidades A principal prioridade da Qiandu é a privacidade e segurança do cliente. Prometemos nunca divulgar informações do cliente e pretendemos fornecer soluções personalizadas, que vão desde o desenvolvimento de websites, segurança de rede, marketing empresarial, blockchain, pagamento e garantia e outras áreas para atender às as suas necessidades exclusivas. serviço blockchain web3 A QianDu fornece serviços de consultoria, desenvolvimento e outros serviços para cadeias industriais, tais como blockchain, NFT, Yuanverse, criptomoeda, bolsas/carteiras descentralizadas, etc.\nConsultor de Cibersegurança A Qiandu tem uma equipa de segurança muito profissional, que pode fornecer serviços de consultoria de segurança individuais ou serviços de consultoria de segurança de rede prontos a utilizar, com base nas necessidades do seu negócio.\nWeb e aplicações A QianDu fornece serviços profissionais de personalização de redes e aplicações. Só precisa de fornecer os documentos de exigência e o seu orçamento, e nós avaliaremos o período de construção e a viabilidade em 24 horas.\ntransação segura A Qiandu é uma empresa de garantia de resultados, quer seja um prestador de serviços ou um cliente, os nossos profissionais irão sempre ajudá-lo a cumprir a sua garantia de privacidade.\nconsultor de marketing empresarial A QianDu fornece soluções de marketing de plataforma completa para Google, FaceBook, X, Instagram, TikTok, Youtube, etc.\nComércio de software pronto a usar A QianDu depende de clientes comerciais e de código fechado de centenas de programadores para fornecer produtos.\nAtendimento 24 horas para si Não importa o problema que encontre, o QianDu pode ajudá-lo a resolvê-lo.\nContate-nos "},"title":"Servir"},"/pt/web3/":{"data":{"":"","#":" Explore as infinitas possibilidades do blockchain Web3 Implantar negócios blockchain web3. Liderar a nova tendência da economia digital no futuro Contate-nos Emissão de tokens Fornece serviços completos de acompanhamento de processos, como emissão de tokens, desenvolvimento de site oficial de tokens, desenvolvimento descentralizado de câmbio de moeda virtual, desenvolvimento de carteira de moeda virtual e listagem de tokens.\nNTF Fornecer serviços de acompanhamento de processos completos, como emissão de NTF, desenvolvimento de website oficial de NTF, recibos de câmbio de NTF, gestão de carteira de NTF e listagem de NTF. .\nmetaverso Desenvolvimento de projetos no metaverso, VR, AR/MR e outras áreas.\nA tecnologia blockchain Web3 está a remodelar o mundo. O nosso estúdio está empenhado em fornecer-lhe uma gama completa de serviços profissionais, cobrindo cadeias industriais como blockchain, NFT, Metaverso, criptomoeda, bolsas/carteiras descentralizadas, etc. Servir Temos uma equipa experiente de especialistas que conduzem pesquisas e práticas aprofundadas nestas áreas de ponta. Se precisa de consultoria sobre tecnologia blockchain, espera desenvolver projetos NFT inovadores, criar uma experiência imersiva no metaverso ou até mesmo construir bolsas e carteiras descentralizadas seguras e fiáveis, podemos ajudá-lo a fornecer soluções precisas, eficientes e profissionais.\nProcesso de cooperação Comunicação de requisitos: Estabelece o contacto inicial com a nossa equipa para elaborar as suas necessidades e expectativas em termos de blockchain, NFT, Metaverso, bolsas/carteiras descentralizadas, etc.\nPersonalização da solução: Com base nas suas necessidades, realizamos estudos de mercado e análises técnicas aprofundadas para personalizar soluções exclusivas para si.\nAssinatura do acordo: Depois de ambas as partes chegarem a um acordo sobre o plano, assinam um acordo de cooperação que vincula o conteúdo da cooperação de ambas as partes e clarifica os direitos e obrigações de ambas as partes.\nPagamento de capital inicial: Pagar um capital inicial não inferior a 50% do valor total do projeto à QianDu.\nLançamento do projeto: Forme uma equipa de projeto profissional, desenvolva um plano e um cronograma detalhados do projeto e lance oficialmente o projeto.\nComunicação regular: Durante o projeto, mantemos uma comunicação regular, informamos o progresso do projeto em tempo útil e ouvimos as suas opiniões e sugestões.\nEntrega de resultados: Entregar os resultados do projeto de acordo com o prazo e os padrões acordados no contrato e fornecer apoio técnico e formação relevantes.\nPagar o saldo: pagar o valor restante da cooperação do projeto\nServiço pós-venda: Após a entrega do projeto, oferecemos um serviço pós-venda contínuo para garantir um funcionamento estável e a otimização e atualização do projeto."},"title":"serviço blockchain web3"}}